package ir.guardianapp.guardian_v2.extras;

import java.util.ArrayList;
import java.util.Random;

public class TipHandler {

    ArrayList<String> allTips = new ArrayList<>();

    public TipHandler() {
        allTips.add("گاردین کمک می کند شما در طول سفر هوشیار بمانید.");
        allTips.add("لطفا به منظور حفظ سلامت خودتان در ابتدای روز خواب خود را در برنامه وارد کنید.");
        allTips.add("گاردین شما را به سلامت به مقصد میرساند.");
        allTips.add("می توانید در هر لحظه از سفر از وضعیت آب و هوایی مسیر آگاه شوید.");
        allTips.add("در هر لحظه از سفر سرعت رانندگی شما به صورت دقیق به شما گزارش می شود.");
        allTips.add("نزدیک ترین مجتمع رفاهی یا پمپ بنزین در طول سفر به شما گزارش می شود.");
        allTips.add("گاردین در ایجاد سفری لذت بخش و ایمن برای شما قدم برمیدارد.");
        allTips.add("هنگامی که در خودرو می نشینید گاردین به صورت هوشمند به شما اعلان میدهد. لطفا برنامه را باز کنید تا سفری لذت بخش تر را تجربه کنید.");
        allTips.add("هنگامی که وضیت شما برای رانندگی مناسب نیست گاردین به شما پیشنهادات مناسب می دهد.");
        allTips.add("گاردین سعی می کند با برقراری ارتباط صوتی شما را هوشیار نگه دارد.");
        allTips.add("۳۰ کیلومتری شهرهای بزرگ از مناطق پرخطر جاده ها هستند.");
        allTips.add("تمام قابلیت های گاردین به صورت صوتی هستند تا حواس شما در طول رانندگی پرت نشود.");
        allTips.add("گاردین همانند یک دستیار صوتی هوشمند تا پایان سفر همراه شماست.");
        allTips.add("در هر لحظه از سفر \"درصد رانندگی سالم\" به شما نشان می دهد چقدر وضعیت شما برای رانندگی مناسب است!");
        allTips.add("در صورت استفاده از گاردین می توانید از مزایای بسیاری بهره مند شوید!");
        allTips.add("لطفا برای سلامتی خود و خانواده تان به هشدارهای گاردین توجه فرمایید!");
        allTips.add("گاردین تا ۳۰ درصد به سلامت رانندگی شما کمک می کند!");
        allTips.add("در صفحه اصلی برنامه می توانید \"میانگین درصد رانندگی سالم\" خود را طی سفرهای اخیر مشاهده کنید.");
        allTips.add("در ابتدای سفر با انتخاب گزینه ی \"شروع سفر\" سفر خود را آغاز کنید.");
        allTips.add("هنگامی که وضعیت شما برای رانندگی مناسب نباشد حالت خطر اپلیکیشن فعال می شود.");
        allTips.add("لطفا در صورت فعال شدن حالت خطر حتما برای سلامت خودتتان مدتی استراحت کنید.");
        allTips.add("در حالت خطر گاردین، هرچند دقیقه یکبار، گاردین به منظور هوشیار نگه داشتن شما اقدام به ارتباط صوتی گرفتن با شما می کند.");
        allTips.add("لطفا به درستی به سوالاتی که در حالت خطر از شما پرسیده می شود پاسخ دهید.");
        allTips.add("شما می توانید از منوی \"تنظیمات\" امکان فعال شدن حالت خطر برنامه را روشن یا خاموش کنید.");
        allTips.add("شما می توانید از منوی \"تنظیمات\" اعلان های صوتی برنامه را در بازه های زمانی مشخص دریافت کنید و میزان ارتباط صوتی گاردین با خودتان را تنظیم کنید.");
    }

    public String getTip() {
        Random rand = new Random();
        // Generate random integers in range 0 to 24
        int rand_int = rand.nextInt(25);
        return allTips.get(rand_int);
    }
}
