package ir.guardianapp.guardian_v2.DrivingStatus.location;

import android.Manifest;
import android.app.Activity;
import android.app.AlertDialog;
import android.app.Service;
import android.content.Context;
import android.content.DialogInterface;
import android.content.Intent;
import android.content.pm.PackageManager;
import android.location.Location;
import android.location.LocationListener;
import android.location.LocationManager;
import android.os.Bundle;
import android.os.IBinder;
import android.provider.Settings;
import android.util.Log;

import androidx.annotation.Nullable;
import androidx.core.app.ActivityCompat;

public class GPSTracker extends Service implements LocationListener {

    private Context context;
    private LocationManager locationManager;
    private Location location;
    private double latitude;
    private double longtitude;
    int PERMISSION_ID = 44;
    private boolean isGPSEnabled = false;
    private boolean isNetworkEnabled = false;
    private boolean canGetLocation = false;
    private long timeUpdate = 5000;
    private long distanceUpdate = 10;
    private int counter;
    private Location destLocation = new Location("destLocationn");
    private double[] result = new double[31];
    private double min;
    private int cityIndex;
    private String nearestCIty;
    private double nearestDistance;
    private double placeDistance;

    public double getMinPlaceDistance() {
        return minPlaceDistance;
    }

    public void setMinPlaceDistance(double minPlaceDistance) {
        this.minPlaceDistance = minPlaceDistance;
    }

    public String getPlaceName() {
        return placeName;
    }

    public void setPlaceName(String placeName) {
        this.placeName = placeName;
    }

    private double minPlaceDistance;
    private String placeName;
    private double nearestPlaceLatitude;
    private double nearestPlaceLangtitude;

    String[] cities = {"Tehran", "Mashhad", "Isfahan", "Karaj", "Shiraz", "Tabriz", "Qom", "Ahvaz", "Kermanshah", "Orumiyeh", "Rasht", "Zahedan"
            , "Kerman", "Yazd", "Ardabil", "BandarAbbas", "Arak", "Zanjan", "Sanandaj", "Qazvin", "Khorramabad", "Gorgan", "Sari", "Bojnourd",
            "Bushehr", "Birjand", "Ilam", "Shahrekord", "Semnan", "Yasuj", "Hamedan"};

//    String[] TehranPlaces = {"پمپ بنزین آفتاب البرز", "Shahbaz Gas Station", "پترو صدف پمپ بنزین و پمپ گاز ارسطو", "Gas Station", "gas station",
//            "Jahan Ara Petrol Station", "جایگاه اختصاصی کوثر پرند", "Robat Karim Gas Station", "جایگاه CNG میلاد نور هفت لنگ", "جایگاه پمپ بنزین پروما",
//    "جایگاه بنزین حافظیه", "پمپ بنزین", "جایگاه سوخت خلیج فارس (۱)", "پمپ بنزین و مجتمع رفاهی فانوس", "پمپ بنزین عطر یاس", "مجتمع خدماتی رفاهی خوشرکاب", "پمپ بنزین المپیک",
//    "پمپ بنزین قرچک", "مجموعه خدماتی و رفاهی طلوع افتاب پیشوا", "Gas Station", "پمپ بنزین دماوند", "مجتمع خدمات رفاهی سیب (فتحعلی)", "جایگاه سوخت آبسرد",
//    "پمپ بنزین جابان", "Gas Station", "مجموعه رفاهی و پمپ بنزین فیروزان", "پمپ بنزین وCNG مجتمع زیتون", "Namrood Gas Station", "gas station"};
//
//    double[] TehranLongtitudes = {51.086997,50.724624,50.893774,50.924799,51.076468,51.152037,50.994843,51.110692,51.13845,51.261035,51.173249,
//            51.25248,51.202769,51.282847,51.304688,51.300301,51.334177,51.567798,51.722472,51.994503,52.007881,52.07207,52.140535,52.25539,
//            52.36373,52.442646,52.667586,52.679867,53.121574};
//
//    double[] TehranLatitudes = {35.745999,35.710388,35.683411,35.672594,35.693513,35.643484,35.466128,35.488604,35.508104,35.569628,35.314731
//            ,35.374871,35.427768,35.505476,35.515194,35.506483,35.504733,35.44798,35.322453,35.771342,35.69174,35.672901,35.661381,35.64002
//            ,35.641213,35.654384,35.723327,35.732245,35.603842};

    String[] TehranPlaces = {"پمپ بنزین آفتاب البرز", "Shahbaz Gas Station", "پترو صدف پمپ بنزین و پمپ گاز ارسطو", "Gas Station", "gas station",
            "Jahan Ara Petrol Station", "جایگاه اختصاصی کوثر پرند", "Robat Karim Gas Station", "جایگاه CNG میلاد نور هفت لنگ", "جایگاه پمپ بنزین پروما",
            "جایگاه بنزین حافظیه", "پمپ بنزین", "جایگاه سوخت خلیج فارس (۱)", "پمپ بنزین و مجتمع رفاهی فانوس", "پمپ بنزین عطر یاس", "مجتمع خدماتی رفاهی خوشرکاب", "پمپ بنزین المپیک",
            "پمپ بنزین قرچک", "مجموعه خدماتی و رفاهی طلوع افتاب پیشوا", "Gas Station", "پمپ بنزین دماوند", "مجتمع خدمات رفاهی سیب (فتحعلی)", "جایگاه سوخت آبسرد",
            "پمپ بنزین جابان", "Gas Station", "مجموعه رفاهی و پمپ بنزین فیروزان", "پمپ بنزین وCNG مجتمع زیتون", "Namrood Gas Station", "gas station","پمپ گاز"
            ,"پمپ بنزین صفادشت","Mahdasht Gas Station","CNG Station","gas station","CNG Station","پمپ بنزین و گاز یوسف آباد قوام","پمپ گاز صفادشت","Abbas abad Gas Station"
            ,"پمپ بنزین اختصاصی جشنی","Meshkindasht CNG Station","جایگاه سوخت برادران حسینی","auto serice alipour","khosravi Gas Station","پمپ بنزین احمدی"," CNGجایگاه گاز "
            ,"Gas Station","Parand Gas Station","Kowsar Gas CNG Station","Gas Station","Persian Golf Gas Station","Milad nor haft lang gas station"
            ,"Baharestan Gas Station","Petrol Station","Gas Station CNG","IKAC pump","جایگاه سوخت هما","Gas station Shamsabad","Gas Station","Gas Station"
            ,"Gas Pump Shams Abad Inustrial zone","پمپ بنزین و گاز خدایی","پمپ بنزین جواد آباد","Natural Gas Station","gas station","Arya CNG and Gas Station"
            ,"Gas Station","Kourosh Gas Station","Gas station","zomorrod","Gas station","Gas station","gas station","gas station","nasr gas station","niyayesh gas station"
            ,"جایگاه بنزین و cng","SiahManssoori Gas Station","پمپ بنزین کوهستان","gas station","gas station","پمپ گاز CNG","جایگاه سوخت cng"
            ,"اسمایل آباد","پمپ بنزین صبا شهر","Almas Gharb Gas Station","gas station","پمپ بنزین","CNG station","طلاییه","پمپ بنزین آزادگان","جایگاه آزادگان شهرداری قرچک"
            ,"Qarchak Gas Station","Varamin faraji Gas Station","جایگاه شماره 4 شهرداری ورامین cng","جایگاه cng","تهران نوخاقانی آشتیانی چایچی"
            ,"پمپ بنزین پیشوا","پمپ بنزین جلیل آباد","پمپ بنزین","Aryana Gas Station","پمپ بنزین قوهه","Fuel Pump Station","پمپ بنزین","پمپ بنزین و گازوئیل شهرک صنعتی خاوران"
            ,"پمپ بنزین ضامن آهو","پمپ بنزین","ava wood color gas station","پمپ بنزین ستاره شرق","پمپ بنزین خاور شهر","پمپ گاز پرچم cng","gas station"
            ,"پترو صدف جایگاه 168","پمپ بنزین","پمپ بنزین کمربندی فیروزان","Qal'e no petrol station","جایگاه سوخت یهند","پمپ بنزین جهان بهرام","پمپ بنزین کهریزک"
            ,"gas station","Fanoos petrol station","پمپ بنزین","پمپ بنزین آفتاب","پمپ بنزین عطر یاس","Proma Petrol pump","Chahardangeh Industrial Town Gas Station"
            ,"cng پمپ گاز شهرک صنعتی چهار دانگه","Mahan convoy industrial zone four Dangeh","motahari natural gas station","chahardangeh gas station"
            ,"jasmine gas station","gas station","gas station","Alborz petrol and CNG station","Eidi petrol station","Khosravi Gas station","Tohid Gas Station"
            ,"پمپ بنزین اختصاصی افق","Gas Station Sabalan","پمپ بنزین و گاز خلیج فارس","کمر بند سبز اندیشه","پمپ بنزین پترواپل","جایگاه بنزین و گازوئیل"
            ,"Andisheh Gas and CNG Station","Pasargad Gas and oil Station","جایگاه گاز طبیعی  cng","پمپ بنزین بخشنده","Yadegari Petrol Station","Imam Reza Gas Station"
            ,"Gas Station 4","Bhatta Gas Station","جایگاه سوخت قمر بنی هاشم","Ferdosiyeh Gas Station","Vahidie Gas Station","Gas Station","CNG station"
            ,"Enghelab Gas Station","gas station","CNG natural gas station","Aftab","Behran Gas Station","CNG gas station","اداره رفاه سایپا"
            ,"khalij-e Fars Lake Petrol Station","Baytran Gas Station","Petran","Gas station","Petran Gas Station","CNG Station","Atlas Petro Gas station"
            ,"SADRA gas station","جایگاه سوخت پتران","Gas station","Gas station","Azadegan Gas station","Kian Gas station","Gas station","Gas station"
            ,"Azadi Stadium Gas station","Olympics Town Gas Station","Pertan gas station","Kan gas station","Gas station 165","IGas","Azadi Gas Station"
            ,"Jenaah gas station","petrol Azadi gas station","West terminal gas station","پمپ بنزین فکوری","Gas Petrol Station","elmak gas station"
            ,"پمپ بنزین باغ فیض","sardare jangal gas station","Abshenasan gas station cng","Abshenasan gas station","Shahran gas station"
            ,"Gas station 230 vali asr","petrol station","komeil petrol station","Yadegar petrol station","Petro sadaf filling station","Shahr-Ara gas station"
            ,"No. 240 gas station","Rahvar gas station","Dadman Gas station","Allameh gas station","Golabtoon gas station","Hakim CNG station"
            ,"Yosef Abad Gas station","jordan gas station","Mirdamad Gas station","جایگاه سوخت","Pasdaran petrol station","chahrrah qanat petrol"
            ,"petrol station pasdaran","Niavaran gas station","Valenjak gas station","gas station","gas station","proma shariati petrol"
            ,"sadr-bridge petrol station","Gas station","Ariafar gas station","No. 240 gas station","vesal gas station","Hor station","gas station 165"
            ,"Al-ghadir gas station","Dolatkhah gas station","Petrol station","gas station","gas station No. 183","Gas","Beryanak gas station"
            ,"پمپ بنزین میدان بهمن","Gas station","Gas station","Gas station","Gas station Abrisham","جایگاه سوخت دو منظوره 264"
            ,"Gas station 192","petrol station","Khorasan gas station","gas station","بهران اسماعلیان","IRANPAKHSH","Ferdosi petrol station"
            ,"Imam Hoessein Gas station","Gas station No. 123","Petrol station Mahalati","Mirza shirazi gas station","Mofateh petrol station"
            ,"Pakistan gas station","Khoramshahr gas station","Shariati Park Gas station","saei Petrol station","Gas station #119"
            ,"Bahar Shiraz 155 Gas station","Qasem abad Gas station","Gas station","Gas station Zeinabieh","Khavaran Gas(Petrol) station","gas station"
            ,"gas station","پمپ بنزین مسعودیه","Takhti petrol station","Abouzar CNG station","Kerman Gas station","104 petrol station"
            ,"211 پمپ بنزین یاسینی","Gas and Petrol station 285","Gas Station","Parvin Gas station","Seraj Petrol Station","جایگاه گاز طبیعی شلمچه 227"
            ,"Gas station Hakimiyeh","Petrol Sadaf 169 Gas station","Gas station","پمپ بنزین","Shasid rasouli petrol station","Auto Technic"
            ,"pcigroup","Lavasan Gas station","Gas Station","Fasham Gas Station","Tappeh saif Gas station","Gas station Kamard","پمپ بنزین سادات"
            ,"Gas station","پترو صدف جایگاه پردیسان","جایگاه فدک cng","Boumehen Gas Station","Bumehen gas station","Gas station","Askari gas station"
            ,"Petro sadaf ShirMohammadi Gas station","Gas satation","پمپ بنزین دو منظوره","Velayat Gas Station","پمپ ینزین","پمپ بنزین دو منظوره بعثت"
            ,"Damavand CNG station","Absard Gas station","پمپ بنزین کیلان","pomp benzin","پمپ گاز CNG","Firozan Gas station"," cng جایگاه سوخت "
            ,"پمپ بنزین فیروز کوه","Gas station"};

    double[] TehranLongtitudes = {51.086997,50.724624,50.893774,50.924799,51.076468,51.152037,50.994843,51.110692,51.13845,51.261035,51.173249,
            51.25248,51.202769,51.282847,51.304688,51.300301,51.334177,51.567798,51.722472,51.994503,52.007881,52.07207,52.140535,52.25539,
            52.36373,52.442646,52.667586,52.679867,53.121574,50.80493,50.83131,50.82782,50.83659,50.89415,50.90487,50.91457,50.86362,50.88748
            ,50.91823,50.92743,50.93826,50.94457,50.96974,50.93031,51.01340,50.91622,50.98841,50.99475,51.17205,51.20290,51.13848,51.09776,51.25257
            ,51.26040,51.16480,51.18127,51.20831,51.17208,51.17538,51.30406,51.61022,51.67186,51.71625,51.64599,51.60585,51.67435,51.81389,51.77029
            ,51.69362,51.30074,51.35269,51.40174,51.39145,51.13487,51.20942,51.64292,51.63725,50.988514,51.13583,51.17102,51.17461,51.15837
            ,51.15845,51.11308,51.09706,51.04038,51.07446,51.58257,51.57594,51.56585,51.56557,51.56789,51.64210,51.64102,51.70679,51.70750,51.70925
            ,51.77868,51.79730,51.83385,51.66611,51.66651,51.67206,51.59878,51.59574,51.59554,51.60494,51.56870,51.56820,51.58372,51.54018
            ,51.53193,51.50163,51.49483,51.50626,51.40615,51.35247,51.35563,51.30073,51.28216,51.28388,51.30364,51.30474,51.26081,51.31001
            ,51.31550,51.29926,51.31665,51.30799,50.96232,50.96896,50.98192,50.99505,50.98564,50.96973,51.00450,50.96265,50.91748,51.01814
            ,51.02422,51.02995,51.04393,51.02665,51.01025,51.00984,50.99795,51.03247,51.04988,51.02278,51.04868,51.04472,51.03963,51.03927
            ,51.04038,51.05835,51.12563,51.14182,51.14506,51.12024,51.14025,51.16305,51.17048,51.21224,51.22189,51.25290,51.25311,51.25768
            ,51.25857,51.25390,51.26055,51.26081,51.25623,51.19774,51.22488,51.22352,51.27429,51.28554,51.28559,51.26407,51.25769,51.27624
            ,51.29059,51.34142,51.34215,51.33727,51.33324,51.33320,51.32589,51.33623,51.31838,51.32211,51.31890,51.31343,51.31544,51.29473
            ,51.27993,51.34960,51.37843,51.35555,51.37214,51.37023,51.38978,51.36749,51.35413,51.35362,51.37035,51.39196,51.40514,51.42047
            ,51.43328,51.44418,51.46391,51.45172,51.47592,51.45662,51.40622,51.39302,51.42304,51.43393,51.43585,51.42304,51.35571,51.38978
            ,51.40070,51.39279,51.29060,51.31208,51.34228,51.35247,51.35741,51.36293,51.35414,51.37213,51.39703,51.43879,51.43648,51.43482
            ,51.42354,51.41196,51.44377,51.41643,51.44807,51.43148,51.42486,51.42753,51.41915,51.45442,51.46194,51.46352,51.41570,51.42811
            ,51.42313,51.43725,51.44913,51.41111,51.44449,51.43918,51.46954,51.48686,51.50558,51.47420,51.50228,51.48793,51.49433,51.50807
            ,51.48774,51.48109,51.51348,51.53040,35.72419,51.52283,51.54148,51.51964,51.57991,51.59026,51.59376,51.62292,51.57736,51.53457
            ,51.50788,51.48493,51.64914,51.53574,51.52928,51.71532,51.75405,51.78249,51.79808,51.80332,51.83642,51.84916,51.85216,51.85637
            ,51.88488,51.90611,51.90999,51.91137,51.95861,51.97725,52.00739,52.00945,52.14054,52.15552,52.30264,52.36416,52.44870,52.73321
            ,52.77484,53.12128};

    double[] TehranLatitudes = {35.745999,35.710388,35.683411,35.672594,35.693513,35.643484,35.466128,35.488604,35.508104,35.569628,35.314731
            ,35.374871,35.427768,35.505476,35.515194,35.506483,35.504733,35.44798,35.322453,35.771342,35.69174,35.672901,35.661381,35.64002
            ,35.641213,35.654384,35.723327,35.732245,35.603842,35.71995,35.69087,35.72671,35.74127,35.68293,35.68185,35.67529,35.69006,35.737993
            ,35.75845,35.75697,35.75140,35.74818,35.76730,35.63096,35.56995,35.50421,35.47714,35.46607,35.31416,35.42801,35.50811,35.53447,35.37479
            ,35.38048,35.40748,35.40165,35.34770,35.31415,35.31201,35.37649,35.26358,35.21976,35.29042,35.36386,35.38825,35.43850,35.41429,35.43084
            ,35.50043,35.50608,35.50241,35.53994,35.58686,35.50510,35.52948,35.36391,35.39747,35.477619,35.53034,35.55859,35.55551,35.55125
            ,35.55696,35.56323,35.58250,35.59977,35.51417,35.41378,35.42606,35.42917,35.42904,35.44805,35.32956,35.36729,35.30680,35.31091,35.31418
            ,35.34769,35.40989,35.43181,35.47858,35.49506,35.51510,35.54301,35.54241,35.54376,35.55018,35.55353,35.55367,35.54894,35.57748
            ,35.58572,35.55013,35.53976,35.52014,35.49668,35.50209,35.50648,35.50609,35.50561,35.50606,35.51345,35.51519,35.56946,35.57755
            ,35.57533,35.59578,35.60519,35.60937,35.70320,35.71594,35.71049,35.72615,35.74074,35.76730,35.74389,35.74276,35.70782,35.74575
            ,35.71018,35.71106,35.69649,35.69212,35.69149,35.69059,35.69416,35.67710,35.67881,35.67068,35.64336,35.63875,35.62015,35.61558
            ,35.59977,35.59388,35.72058,35.69672,35.71514,35.75426,35.74525,35.72406,35.72932,35.75708,35.76355,35.75370,35.75468,35.75777
            ,35.75173,35.73306,35.72277,35.72299,35.70760,35.69828,35.68573,35.67070,35.71502,35.71802,35.71737,35.74958,35.75777,35.75330
            ,35.67668,35.69913,35.69939,35.70981,35.70984,35.70997,35.70652,35.72462,35.74618,35.75204,35.75344,35.76851,35.77048,35.78012
            ,35.75445,35.67848,35.68150,35.69097,35.70082,35.71274,35.71741,35.73060,35.76447,35.79160,35.73600,35.74261,35.74216,35.76998
            ,35.76025,35.76381,35.77505,35.78035,35.79632,35.81226,35.79256,35.81101,35.80580,35.79991,35.78129,35.80579,35.73169,35.71741
            ,35.70138,35.68965,35.67668,35.63581,35.63058,35.60984,35.62504,35.64216,35.64424,35.66788,35.65072,35.60080,35.62404,35.63859
            ,35.63257,35.64478,35.62262,35.66729,35.66510,35.68172,35.68551,35.68600,35.70259,35.70366,35.69198,35.67245,35.72064,35.72301
            ,35.73005,35.73552,35.74843,35.73223,35.72536,35.71568,35.70779,35.69232,35.70776,35.64457,35.60636,35.62876,35.63548,35.66530
            ,35.67295,35.73739,35.72156,35.72176,51.53394,35.73171,35.74063,35.75031,35.72942,35.73590,35.74164,35.73877,35.75774,35.77724
            ,35.77333,35.78308,35.82603,35.87888,35.93336,35.74883,35.74876,35.73866,35.74810,35.74867,35.73720,35.73208,35.73680,35.71473
            ,35.72616,35.73252,35.73601,35.72203,35.75311,35.70736,35.69246,35.69050,35.66143,35.58487,35.63553,35.64128,35.65771,35.75129
            ,35.75635,35.60376};


    String[] MashhadPlaces = {"gas station","پمب بنزین سلطانی","پمپ بنزین غفاری 404","پمپ بنزین حکیم آباد","پمپ بنزین سیدآباد","پمپ بنزین","پمپ گاز طبیعی ذبیحی",
            "پمپ بنزین جم خلیل صالحی","gas station","پمپ گاز","Gas Station","پمپ بنزین علی آبادی","جایگاه بنزین اختصاصی منتظرالقائم","پمپ بنزین","پمپ بنزین","پمپ بنزین چکنه","پمپ بنزین گل بین"
            ,"پمپ بنزین بونصر مشکان","پمپ بنزین نورآبادی","پمپ بنزین شهید عباس برغمدی","پمپ بنزین عطاملک","جایگاه چند منظوره آفتاب شرق","جایگاه اختصاصی امام رضا (ع)","پمپ بنزین"
            ,"پمپ بنزين ريوند","جایگاه سوخت استیر","پمپ بنزین و پمپ گاز ایران زمین","پمپ بنزین","جایگاه سوخت دو منظوره بیهق","جایگاه اختصاصی بهمن","gas station"
            ,"جایگاه پمپ بنزین اختصاصی خیام","پمپ بنزین حسن آبادسالار / جایگاه امینی","Petrol Station","پمپ بنزین زرندی","مجتمع رفاهی سیمرغ","gas station","جایگاه بنزین فاطمی"
            ,"پمپ بنزین","پمپ بنزین","پمپ بنزین","انابد پمپ بنزین جایگاه طوس","مجتمع خدمات رفاهی امام رضا ( ع )","پمپ بنزین ابراهیمی","پمپ بنزین رباط سنگ","جایگاه CNG شهرداری رباط سنگ"
            ,"پمپ بنزین جایگاه حسینی-نوریان","gas station","پمپ بنزین و پمپ گاز","پمپ بنزین اوجادی","پمپ بنزین باخرز","پمپ بنزین سیدالحسینی","پمپ بنزین شیرکی","پمپ بنزین دولت آباد"
            ,"پمپ بنزین کاریز بالا","پمپ بنزین اسدی","پمپ بنزین رمضانی","gas station","جايگاه اختصاصي فروغ آفتاب","پمپ بنزین باسفر","gas station","پمپ بنزین پهلوان"
            ,"Gas station setaregan kavir jafar abad","پمپ بنزین","پمپ بنزین فیض آباد","gas station","پمپ بنزین مزدی","پمپ بنزین انارستانک"
            ,"Al Mahdi Road welfare suite","پمپ بنزین عظیم تون","پمپ بنزین اسلامیه","جایگاه اختصاصی احمدی گرماب، کشاورز"};

    double[] MashhadLongtitudes = {56.872695,57.0632,57.357516,57.52907,57.639819,57.71351,57.678995,57.668963,58.075784,58.283486,58.512495
            ,58.773157,59.044704,59.15901,59.319671,59.58716,60.123054,60.85404,61.11821,57.82345,58.003997,59.363423,59.213494,59.199021
            ,59.227339,59.737974,59.97731,60.809646,60.321563,60.149558,59.639641,59.518038,59.474931,59.296722,60.759415,60.096014
            ,59.604594,59.421832,58.83893,58.675062,58.098303,58.436442,58.792182,58.838936,58.27415,58.251754,58.203455,58.244043
            ,58.211108,57.411086};

    double[] MashhadLatitudes = {37.102069,37.089477,36.950943,36.779494,36.745119,36.614469,36.649194,36.641409,36.581234,36.563953
            ,36.523073,36.479547,36.412995,36.106886,36.169878,36.793642,36.661978,36.591032,36.405551,36.508332,36.610488,36.355648
            ,36.344977,36.315957,36.225784,36.211957,36.205871,36.198592,36.190811,36.192393,36.169613,36.100296,36.125764,36.236382
            ,36.107832,36.030745,35.989933,35.989726,36.029783,36.385479,36.496896,35.254284,35.249867,35.785865,35.575365,35.547299
            ,35.373684,35.780774,35.620991,34.849325,34.996047,35.111677,35.29901,35.293882,35.297524,35.308223,34.711631,34.600194
            ,34.975432,35.096561,34.9957,34.400964,34.99855,34.797348,35.019497,34.995662,34.093249,34.239918,34.513373,34.057053
            ,34.035972,33.889865};

    String[] IsfahanPlaces = {"پمپ بنزین و cng","مجتم خدمات رفاهی باران","پمپ بنزین پیرمرادیان","پمپ بنزین","پمپ بنزین و گاز","جایگاه سوخت پارس","پمپ بنزین اکبری","جایگاه پمپ بنزین"
            ,"پمپ بنزین قائم فروغی","ایستگاه سوخت شهرداری کوهپایه","پمپ بنزین نصیری 2","پمپ بنزین","جایگاه سوخت دو منظوره ملکا","پمپ بنزین عسگران","پمپ بنزین دهدشتی"
            ,"جایگاه بنزین اختصاصی عبدالهی","پمپ بنزین","پمپ بنزین الغدیر","جایگاه چند منظوره طهماسبی","اقامتگاه بین راهی و پمپ بنزین و گازوییل","مجتمع خدماتی رفاهی بی همتا آیریک"
            ,"ایستگاه گاز","پمپ بنزین جنتی","پمپ بنزین سه راهی نطنز","پمپ بنزین صفوی سُهی","مجتمع خدماتی رفاهی گل یاس","پمپ بنزین قرقچی","ایستگاه موته","مجتمع رفاهی پردیس کویر،پمپ بنزین"
            ,"پمپ بنزین","جایگاه گاز و بنزین","پمپ بنزین مجتمع رفاهی روناک","مجتمع خدماتی رفاهی قائم","پمپ بنزین مشکات","پمپ بنزین شماره ۲ سرای کویر","مجتمع رفاهی خدماتی آقاجانی"
            ,"جایگاه سوخت مهاباد","مجتمع خدماتی رفاهی آسمان","پمپ بنزین و گازوئیل قنبری","مجتمع خدماتی رفاهی مهرگان","مجتمع خدماتی رفاهی پردیسان","پمپ بنزین","مجتمع خدماتی رفاهی نور"
            ,"پمپ بنزین -جایگاه اختصاصی شفیعی","پمپ بنزین","پمپ بنزين انارك","پمپ بنزین چوپانان","پمپ بنزین جندق","جايگاه اختصاصی شايگان"};

    double[] IsfahanLongtitudes = {51.712825,51.539094,51.646526,51.983666,51.89141,51.887361,51.523381,51.108938,51.934508,52.453251
            ,53.210678,50.988865,50.914147,50.850296,50.500404,50.49632,50.365666,50.175632,50.150829,51.357987,51.490317,50.979595
            ,50.621748,51.468475,51.352695,51.211678,51.119918,50.933213,51.555247,51.890121,51.207093,51.332093,51.319428,51.270945
            ,51.701072,51.959012,52.20497,52.338281,52.368466,52.374755,52.48853,52.473555,52.779262,52.800035,52.990451,53.685879
            ,54.391617,54.408845,55.072071};

    double[] IsfahanLatitudes = {31.200194,31.364331,31.574213,31.843753,32.063082,32.079466,32.265659,32.3441,32.67049,32.71735,32.766588
            ,32.805655,32.841944,32.872316,33.036898,33.02948,32.990802,33.044699,33.066512,32.876839,32.979158,33.093172,33.292933
            ,33.099453,33.215921,33.385278,33.494568,33.69581,33.052003,33.368764,34.008543,33.999632,34.033319,34.173521,33.748363
            ,33.67814,33.519041,33.435134,33.346596,33.320621,33.181953,33.182376,32.975439,32.964813,32.887001,33.297774,33.605949
            ,34.04434,33.784274};

//    String[] KarajPlaces = {"پمپ بنزین آسمان","پمپ بنزین سرای الموت","پمپ بنزین یاشار","Gas and CNG Station","پمپ بنزین تهراندشت","پمپ بنزین طاووسیه","جایگاه اختصاصی پرشین"
//            ,"پمپ بنزین البرز","جایگاه اختصاصی پاسارگاد","پمپ بنزين شروان","جایگاه بنزین تیکمه داش خلج آباد","پمپ بنزین ری زمین","جایگاه سوخت امیرکبیر","پمپ بنزین نساء","پمپ بنزین طلاییه"};
//
//    double[] KarajLatitudes = {35.715678,36.03452,35.991629,35.970665,35.917523,35.882038,35.904315,35.770215,35.75376,35.795283
//            ,35.801828,36.031944,36.032503,36.077489,35.731581};
//
//    double[] KarajLongtitudes = {50.377684,50.575817,50.620536,50.657287,50.75314,50.834448,50.846841,51.038658,51.067957,51.012913,51.010137
//            ,51.17682,51.208447,51.318794,50.600834};

    String[] KarajPlaces = {"پمپ بنزین آسمان","پمپ بنزین سرای الموت","پمپ بنزین یاشار","Gas and CNG Station","پمپ بنزین تهراندشت","پمپ بنزین طاووسیه","جایگاه اختصاصی پرشین"
            ,"پمپ بنزین البرز","جایگاه اختصاصی پاسارگاد","پمپ بنزين شروان","جایگاه بنزین تیکمه داش خلج آباد","پمپ بنزین ری زمین","جایگاه سوخت امیرکبیر","پمپ بنزین نساء","پمپ بنزین طلاییه",
            "Eshtehard Gas Station", "جایگاه سوخت آسمان", "Talaiyeh Gas Station", "Shahbaz Gas Station", "Gas Station", "Salamati Gas Station", "Gas Station",
            "Gas Station", "Gas Station", "Mehrshahr Gas Station","Mehr Gas", "Gas Station", "Shohadaye Shahrdari Gas Station","Gas Station", "Golshahr Gas Station", "Tehran-Karaj Gas Station",
            "Gas Station", "Jasmine Gas Station","Gas Station","Gas Station 4","Petrol Station"};

    double[] KarajLatitudes = {35.715678,36.03452,35.991629,35.970665,35.917523,35.882038,35.904315,35.770215,35.75376,35.795283
            ,35.801828,36.031944,36.032503,36.077489,35.731581,35.721773,35.718856,35.732239,35.710482,35.682964,35.593310,35.835482,35.982234
            ,35.876586,35.794014,35.913663,35.870161,35.855655,35.837870,35.826635,35.763194,35.685431,35.705657,35.676808,35.674155,35.774376};

    double[] KarajLongtitudes = {50.377684,50.575817,50.620536,50.657287,50.75314,50.834448,50.846841,51.038658,51.067957,51.012913,51.010137
            ,51.17682,51.208447,51.318794,50.600834,50.351198,50.377997,50.603200,50.724843,50.894139,50.588828,50.709589,50.762259
            ,50.862826,50.986283,50.800321,50.865567,50.964302,50.935432,50.948135,51.081393,50.893625,50.994062,50.931187,51.033257,51.038262};

    String[] ShirazPlaces = {"پمپ بنزین آرمان","پمپ بنزین امیری","جایگاه سوخت شهید شمسی پور","پمپ بنزین","پمپ بنزین ده کهنه","پمپ بنزین فداغ","پمپ بنزین","جایگاه اختصاصی پمپ بنزین","پمپ بنزین چهاربرکه"
            ,"پمپ بنزین","پمپ بنزین دولتخواه","پمپ بنزین فرهمندنیا","پمپ بنزین چاتیز","پمپ بنزین جویم","پمپ بنزین=شرفویه","پمپ بنزین = بریز","پمپ بنزین=کورده","مجتمع رفاهی شهدای جایدشت"
            ,"جایگاه اختصاصی محمودی","پمپ بنزین و گاز شهرداری میمند","جایگاه سوخت صلاح الدین عالیشوندی","پمپ بنزین کبلاق","مجتمع رفاهی کیلاق","پمپ بنزین جوکان","پمپ بنزین اعتمادی"
            ,"جایگاه اختصاصی صاحب الزمان (ع) (برادران مرادی)","پمپ بنزین","پمپ بنزین استراحتگاه بین راهی","پمپ بنزین بهمنی کوار","پمپ بنزین فورگ","پمپ بنزین لایزنگان","جایگاه بنزین"
            ,"جایگاه سوخت کامیون داران داراب","پمپ بنزین دولت آباد","پمپ بنزین نوبندگان","پمپ بنزین فسا","پمپ بنزین امام علی","پمپ بنزین کاخ ساسان","پمپ بنزین خلیج فارس"
            ,"پمپ بنزین","Petrol Station Of Qatruyeh","پمپ بنزین طالبی","پمپ بنزین و CNG","جایگاه سوخت دو منظوره دلخوش","جایگاه اختصاصی 303 استهبان"
            ,"پمپ بنزين و پمپ گاز","پمپ بنزین","پمپ بنزین و گازوییل و CNG","پمپ بنزین ستاره پریشان","پمپ بنزین و گازوئیل","پمپ بنزین قائمیه","پمپ بنزین و خدمات رفاهی"
            ,"پمپ بنزين كنارتخته","Qasemi Gas Station","پمپ بنزین سید علی حسینی","پمپ بنزین سرداری","پمپ بنزین کارخانه قند","پمپ بنزین بابامیدان","پمپ بنزین روستای دزک"
            ,"پمپ بنزین","Dashtroom","پمپ بنزین","پمپ بنزین","پمپ بنزین منصوری","پمپ بنزین","پمپ بنزين","پمپ بنزین حاج علی کوشش","پمپ بنزین عصرتمدن","پمپ بنزین"
            ,"مجتمع رفاهی","جایگاه پمپ بنزین","پمپ بنزین کولی کش","پمپ بنزین","پمپ بنزین برادران پرهام","مجتمع خدمات رفاهی پرهام","پمپ بنزین سورمق","پمپ بنزین فدک","پمپ بنزین"
            ,"پمپ بزین سه راهی بهمن","جایگاه دومنظوره کمالزاده","پمپ بنزین"};

    double[] ShirazLongtitudes = {53.627217,53.335316,52.955032,52.88743,53.359341,53.571746,53.640632,53.454981,54.60048,53.153523,53.302796
            ,53.520736,53.813806,54.068057,54.130418,54.382611,54.413011,52.653869,52.947943,52.775747,52.126102,52.387162,52.343385,52.571403
            ,53.062129,53.350106,53.623011,52.714023,52.643809,55.210653,54.974073,54.838387,54.498088,54.289828,53.812481,53.634592,53.431483
            ,53.183778,53.056272,52.813401,54.702301,54.478966,54.313956,54.298406,53.997731,53.760339,52.194151,51.987595,51.781889,51.75296
            ,51.622175,51.497426,51.40356,51.547947,51.547098,51.536067,51.521697,51.48158,51.405108,51.218135,51.554163,52.453884,52.372735
            ,52.287617,52.124901,52.002472,52.731905,52.848704,52.916031,53.201154,53.20603,53.182137,52.958675,53.320611,53.390963,52.837516
            ,52.731463,51.948662,52.578442,52.471138,52.0648};

    double[] ShirazLatitudes = {27.219195,27.280959,27.455101,27.539267,27.46559,27.612265,27.726082,27.84257,27.669233,28.16035,28.359558
            ,28.486695,28.40244,28.233,28.052076,27.926257,27.789097,28.77676,28.702781,28.854051,28.820515,28.452215,28.428688,29.032105
            ,29.009945,28.863932,28.617172,29.303861,29.34184,28.331942,28.497048,28.581728,28.734074,28.681091,28.862966,28.983229,29.140589
            ,29.279936,29.282169,29.371328,29.149263,29.232353,29.206675,29.196373,29.138467,29.181253,29.645145,29.659587,29.566434,29.707481
            ,29.835045,29.644776,29.529303,30.089688,30.118866,30.138632,30.198371,30.278978,30.297486,30.320255,30.541461,29.763575,29.843363
            ,29.898234,30.045039,30.23868,29.812234,29.954923,30.059425,30.126811,30.166537,30.762877,31.040381,31.153063,31.196706,31.033259
            ,30.933916,30.703214,31.234311,31.335101,31.683264};

    String[] TabrizPlaces = {"جایگاه بنزین شهید حمید هاشمی","مجتمع خدماتي رفاهي طياري","جایگاه اختصاصی مسن","پمپ بنزین میشو","جایگاه چند منظوره الغدیر","جایگاه سوخت بیلوردی"
            ,"پمپ بنزین طویقون","جایگاه سوخت پردیس","gas station","جایگاه اختصاصی دوزدوزان","جایگاه کیان ۲","پمپ بنزین و  خرم وطنCng","پمپ بنزین دومنظوره جبارزاده"
            ,"جایگاه دو منظوره پدیده آذربایجان","پمپ بنزین خراجو","مجتمع خدمات رفاهی امیری"};

    double[] TabrizLongtitudes = {45.699257,45.595668,45.580977,45.884583,46.029681,46.85635,46.486556,46.435828,45.944194,47.111781
            ,46.783136,47.038516,45.845063,45.968005,46.529136,46.060918};

    double[] TabrizLatitudes = {38.626957,38.453947,38.45103,38.217878,38.249089,38.272518,38.085748,38.004193,37.904188,37.946073,37.854354
            ,37.333295,37.522601,37.437368,37.294334,37.237698};

//    String[] QomPlaces = {"پمپ بنزین مهراد","جایگاه اختصاصی نگین","جایگاه سوخت طلایی","پمپ بنزین ۷۲تن","البرز","جایگاه سوخت مجتمع خدماتی مهر و ماه","جایگاه اختصاصی غزال"
//            ,"پمپ بنزین زیتون","جایگاه اختصاصی مهتاب","Gas Station","مجتمع خدمات رفاهی مارال ستاره حوض سلطان","جایگاه سوخت هفت آسمان","پمپ بنزین","جایگاه اختصاصی کویر سرخ"
//            ,"gas station","پمپ بنزین حرم تا حرم","پمپ بنزین پردیس ترابر بنزين و گاز CNG","Gas Station","پمپ بنزین مارال ستاره"};
//
//    double[] QomLongtitudes = {50.665674,50.804518,50.844386,50.896772,50.865719,50.866657,50.845145,50.84831,50.855346,50.827251
//            ,50.851879,50.899186,50.983851,50.987658,51.068282,51.264937,50.966043,50.987804,51.090043};
//
//    double[] QomLatitudes = {34.560247,34.601848,34.674408,34.673534,34.711257,34.741927,34.807031,34.836215,34.865943,34.94392
//            ,35.008612,35.086905,34.677199,34.681945,34.723479,34.923702,34.543516,34.524701,34.459277};

    String[] QomPlaces = {"پمپ بنزین مهراد","جایگاه اختصاصی نگین","جایگاه سوخت طلایی","پمپ بنزین ۷۲تن","البرز","جایگاه سوخت مجتمع خدماتی مهر و ماه","جایگاه اختصاصی غزال"
            ,"پمپ بنزین زیتون","جایگاه اختصاصی مهتاب","Gas Station","مجتمع خدمات رفاهی مارال ستاره حوض سلطان","جایگاه سوخت هفت آسمان","پمپ بنزین","جایگاه اختصاصی کویر سرخ"
            ,"gas station","پمپ بنزین حرم تا حرم","پمپ بنزین پردیس ترابر بنزين و گاز CNG","Gas Station","پمپ بنزین مارال ستاره","gas station","پمپ بنزین","Gas station"
            ,"Mahtab Gas station","Pachian Gas station","Gas Station","Majd Gas station","Aftab 2 Gas station","West Aftab Gas station","پمپ بنزین"
            ,"پمپ گازوئیل","پمپ بنزین پامچال غفاری","پمپ بنزین پامچال غفاری","Shahrad Petrol Station","پمپ بنزین مهراد","جایگاه خاطره جاوید"
            ,"Tayeqan Gas and CNG station","Verjan Gas station","پمپ گاز cng ","پمپ بنزین","Gas CNG station","Gas station"
            ,"پمپ CNG","پمپ بنزین","Gas station","جایگاه پمپ بنزین جمکران","Pardisan Gas station","Fatehi gas station","(cngجایگاه سوخت اشرفیان (بنزین و "
            ,"Negin Gas station","Mahan Tandis Gas station","پمپ بنزین","gas station","safa shahr gas station"," cngپمپ بنزین جمهوری و "
            ,"CNG station","Kowsar gas station","sadeghi petrol station","zabeti(azar) gas station","Mehregan CNG Gas station","Gas station"
            ,"Omid Gas station","Persian Petrol and CNG Station","Navvab Gas station","Azadegan gas station","جایگاه اختصاصی زائر"
            ,"Golden Gas station","Anjoman gas station","پمپ گاز CNG ","پمپ بنزین","Pasargad Gas Station","پمپ بنزین","پمپ بنزین"
            ," cngجایگاه قنوات ","پمپ بنزین شهید ابوالفضل","پمپ بنزین ملک آباد"};

    double[] QomLongtitudes = {50.665674,50.804518,50.844386,50.896772,50.865719,50.866657,50.845145,50.84831,50.855346,50.827251
            ,50.851879,50.899186,50.983851,50.987658,51.068282,51.264937,50.966043,50.987804,51.090043,51.17948,50.85227,50.82701,50.85541
            ,50.57699,50.51263,50.51893,50.41376,50.41212,50.41220,50.412001,50.38375,50.463208,50.54360,50.66553,50.692241,50.69190,50.88569
            ,50.87418,50.86421,51.01253,50.98806,50.96727,50.81769,50.92140,50.91895,50.81768,50.81631,50.81640,50.80439,50.80297,50.82257
            ,50.85015,50.84899,50.88451,50.91451,50.84993,50.86046,50.90557,50.91174,50.88788,50.87717,50.83441,50.89985,50.88895,50.83476
            ,50.84458,50.83841,50.83731,50.86087,50.92134,50.98356,50.98398,51.03419,51.002674,51.00176};

    double[] QomLatitudes = {34.560247,34.601848,34.674408,34.673534,34.711257,34.741927,34.807031,34.836215,34.865943,34.94392
            ,35.008612,35.086905,34.677199,34.681945,34.723479,34.923702,34.543516,34.524701,34.459277,34.82424,35.00904,34.94389,34.86600
            ,34.799991,34.779364,34.76055,34.688602,34.690441,34.69036,34.69061,34.73712,34.54255,34.51027,34.56051,34.482962,34.482917,34.43320
            ,34.41058,34.39666,34.51167,34.52506,34.54511,34.54423,34.58663,34.58663,34.54423,34.57305,34.57312,34.60202,34.60348,34.59657
            ,34.60362,34.60410,34.60886,34.61459,34.62743,34.63308,34.63226,34.63772,34.65107,34.65642,34.65329,34.66391,34.67264,34.66645
            ,34.67434,34.65296,34.65323,34.66596,34.64931,34.676601,34.67872,34.60891,34.612533,34.61261};


    String[] AhvazPlaces = {"پمپ بنزین سردشت","پمپ بنزین","پمپ بنزین","Farzaneh Gas Station","پمپ بنزین صحرایی","Gas Station Arjan","پمپ بنزین جایزان"
            ,"پمپ بنزین سلطانی","پمپ بنزین و گازوییل","پمپ بنزین پاسارگاد","پمپ بنزین","جایگاه بنزین افراشته","پمپ بنزین میداوود(ممبینی)","پمپ بنزین","پمپ بنزین و CNG عباس برون"
            ,"جایگاه سوخت یاسین","جایگاه سوخت دو منظوره کایدی","Gas & CNG Station","پمپ بنزین","Gas Station","پمپ بنزین","gas station","پمپ بنزین ظاهری","پمپ بنزین"
            ,"پمپ بنزین","پمپ بنزین","پمپ بنزین هاشمی","پمپ بنزین حمید","پمپ بنزین","پمپ بنزین","جایگاه سوخت","مجتمع خدماتی رفاهی نور(سید نوری موسوی)","جایگاه سوخت قدس"
            ,"پمپ بنزين","پمپ بنزین","پمپ بنزین حسینیه خوزستان","پمپ بنزین پل زال","پمپ بنزین","پمپ بنزین گوشی سرخه","پمپ بنزین","پمپ بنزین","جایگاه سوخت بنادر"
            ,"جایگاه سوخت خالد درخشنده","پمپ بنزین سید عباس","جایگاه ولایت","پمپ بنزين الهايي","پمپ بنزین کوثران","جایگاه شماره شش نظامیه","پمپ بنزین جسانیه","پمپ بنزين"};

    double[] AhvazLongtitudes = {50.234279,50.326294,50.321427,50.346918,50.230921,50.088712,49.883736,49.699958,49.184566,49.422372
            ,48.840282,49.726761,49.81387,49.886651,49.889576,49.847618,49.860116,49.638086,49.240879,49.246399,49.676503,49.732677
            ,49.236192,48.4369,48.608395,48.226101,48.370254,48.308288,48.004857,48.092801,48.293829,48.551531,48.851432,48.629217,48.300555
            ,48.249102,48.085559,47.820795,48.112556,48.282642,48.301406,48.293733,48.301178,48.397992,48.526074,48.585207,48.623164
            ,48.625881,48.730146,48.634403};

    double[] AhvazLatitudes = {30.321459,30.443625,30.4951,30.573748,30.619862,30.726724,30.833019,31.052633,31.219116,31.443289,31.277571
            ,31.526624,31.372916,31.573366,31.619853,31.690354,31.792146,30.744198,30.619793,30.5498,30.463651,30.227253,32.003229,30.750471
            ,31.139357,30.461028,31.071061,31.132165,31.710457,31.479451,31.485233,31.380852,31.45288,32.257385,32.560215,32.674999,32.795927
            ,32.418025,32.355554,32.412546,32.066304,32.030743,31.987349,31.824426,31.717493,31.661442,31.528847,31.450504,31.41229,31.428958};

    String[] KermanshahPlaces = {"gas station","Gas Station","پمپ بنزین برادران سلیمانی و مرادی","پمپ بنزین و پمپ گاز روانسر","Gas Station","پمپ بنزین ماهیدشت"
            ,"Gas Station","Gas Station","Gas Station","پمپ بنزین و پمپ گازوئیل مجتمع خدمات رفاهی ایلیا","Gas Station","جایگاه دو منظوره قند بیستون","پمپ بنزین سنقرآباد - پادروند"
            ,"جایگاه اختصاصی سروش","Gas Station"};

    double[] KermanshahLongtitudes = {46.204894,46.334067,46.592441,46.677113,46.909815,46.901241,46.245975,46.842654,47.091275,47.090113
            ,47.40078,47.444059,47.444768,47.736374,46.886509};

    double[] KermanshahLatitudes = {35.158068,35.065791,34.805227,34.694493,34.661762,34.291189,34.269801,33.873568,34.119410,34.274938
            ,34.364596,34.396554,34.409657,34.455834,33.819219};

    String[] OrumiyehPlaces = {"جایگاه اختصاصی برادران میرزازاده","Gas stations","Gas stations","Gas stations","Gas stations","پمپ بنزین ایران اکتان"
            ,"پمپ بنزین وگاز بانو جعفری","پمپ بنزین ناظم زاده","پمپ بنزین پسوه","پمپ بنزین محمدی","جایگاه اختصاصی دومنظوره فیروز سموعی","پمپ بنزین عزیزی و cng","پمپ بنزین دنیز - ملکی"};

    double[] OrumiyehLongtitudes = {44.937161,44.627387,45.049571,45.228353,44.724074,45.332279,45.738406,45.750716,45.327008,45.840595
            ,46.106278,46.100136,45.456692};

    double[] OrumiyehLatitudes = {39.168199,39.273139,38.909382,38.648447,37.725957,37.2269,36.786922,36.792934,36.796317,36.90456
            ,36.937396,37.160072,37.10652};

    String[] RashtPlaces = {"مجتمع خدماتی رفاهی قوی سفید","پمپ بنزین و گاز نگاه","پمپ بنزین و جایگاه CNG حسینی","پمپ بنزین فتح الهی آستارا","پمپ بنزین و گاز بهزادی","پمپ بنزین عرفان"
            ,"پمپ بنزین طلوع خورشید اسالم","جایگاه سوخت دو منظوره حمداله زاده","پمپ بنزین خوشابر","پمپ بنزین و گاز زارع پاک","جایگاه اختصاصی فومن","Gas Station","gas station"
            ,"جایگاه سوخت دو منظوره حسین قلی‌زاده","پمپ بنزین خدمت گزار","جایگاه اختصاصی عاشوری","پمپ بنزین فرنود","پمپ بنزین دیبا- هاشمی","پمپ بنزین پارسا","جایگاه اختصاصی باران"
            ,"جایگاه افرا","پمپ بنزین","پمپ بنزین افرند","پمپ بنزین پیمان","Gas stations","جایگاه دو منظوره پورصادق","gas station","پمپ بنزین زمانی","پمپ بنزین بابایی شلمان"
            ,"جایگاه دومنظوره جیردهی"};

    double[] RashtLongtitudes = {48.865529,48.857857,48.843184,48.883997,48.897929,48.91521,48.98747,49.116084,49.143654,49.250467,49.313832
            ,49.353572,49.379871,49.371777,49.669258,49.647426,49.636761,49.42609,49.491537,49.657483,49.659117,49.551342,49.503379
            ,49.395181,49.492567,49.720435,49.790281,49.850449,50.230519,50.391311};

    double[] RashtLatitudes = {38.324088,38.371911,38.443698,38.222741,37.83741,37.772952,37.688509,37.560937,37.51232,37.407274,37.249258
            ,37.232511,37.272618,37.497019,37.384423,37.374532,37.363357,37.213619,37.194375,37.102338,37.111473,36.944605,36.921156
            ,36.750121,36.633962,37.277432,37.272677,37.257816,37.157753,37.074584};

    String[] ZahedanPlaces = {"پمپ بنزین امام حسین","جایگاه عرضه بنزین و نفتگاز ثارالله","جایگاه بنزین ونفتگاز امام رضا (ع)","جایگاه اختصاصی عرضه بنزین و نفتگاز پیامبر اعظم ص"
            ,"بنزين","جایگاه سوخت پایانه بار","پمپ بنزین نصرت آباد","پمپ بنزین محمدرسول الله","پمپ بنزین هامون","gas station","جایگاه بنزین تفتان","پمپ بنزین کلچات","پمپ بنزین خاش"
            ,"پمپ بنزین خاتم","پمپ بنزین ریکان","جایگاه دو منظوره کمالزاده","پمپ بنزین","پمپ بنزین","خدمات سوخت رسانی دهواری","جایگاه اختصاصی گلشن","پمپ بنزین علی آباد","بنزین فروشی رند بلوچی خوش"
            ,"پمپ بنزین راسک","پمپ بنزین درخشان","پمپ بنزین پیشین","پمپ بنزین باهوکلات","سه راهی نگور","پمپ بنزین","پمپ بنزين پسابندر","پمپ بنزین سه راهی کنارک نیکشهر چابهار"
            ,"پمپ بنزین","پمپ بنزین","پمپ بنزین","پمپ بنزین نیکوجهان","جایگاه سوخت شماره 2 نیکشهر","پمپ بنزین هیچان","پمپ بنزین مبارکی","مجتمع رفاهی بین راهی"};

    double[] ZahedanLongtitudes = {61.493338,61.803388,61.447682,61.399873,60.859676,60.823357,59.98237,60.820269,60.825013,61.463947
            ,60.812276,61.024754,61.196207,60.769071,60.718802,61.577219,61.659858,61.685814,62.395822,62.017247,61.228034,61.296983
            ,61.395547,61.456105,61.713842,61.408903,61.116586,60.71157,61.408808,60.481091,59.96956,59.409591,59.130919,60.155522
            ,60.196208,60.070751,60.319077,60.619914};

    double[] ZahedanLatitudes = {30.978217,30.968739,30.853349,30.760696,30.186268,29.571747,29.855776,29.550311,29.410741,29.018754
            ,28.577096,28.374172,28.212322,27.859686,27.255167,27.101828,27.121435,27.152046,27.329513,27.298163,26.481118,26.401722
            ,26.241729,26.214377,26.07949,25.721632,25.474193,25.297853,25.069951,25.468814,25.523664,25.593219,25.680956,26.041723
            ,26.243771,26.421952,26.811285,27.053431};

    String[] KermanPlaces = {"پمپ بنزین رازبان","پمپ بنزین رییسی","پمپ بنزین","پمپ بنزین موسی بامری","پمپ بنزین","پمپ بنزین مظفر","پمپ بنزین","پمپ بنزین","پمپ بنزین"
            ,"جایگاه سوخت پردیس","پمپ بنزین شماره ۲ پور حمیدی جنگل آباد","پمپ بنزین","جایگاه سوخت باب الحوائج","پمپ بنزین","پمپ بنزین","پمپ بنزین اهتمام بر","جایگاه اختصاصی گاز طبیعی بیدران CNG"
            ,"پمپ بنزین ابارق","پمپ بنزین دو منظوره غروب","پمپ بنزین امام زمان","پمپ بنزین ساردوییه","پمپ بنزین افق کوروش","مجتمع رفاهی سینا","پمپ بنزين قدس","پمپ بنزین سنگ آهن سیرجان"
            ,"پمپ بنزین چند منظوره کمال آبادی","پمپ بنزین و گازوئیل مکی آبادی","پمپ بنزین خدمات رفاهی زیدآبادی","پمپ بنزین","پمپ بنزین","پمپ بنزین شرکت فولاد بردسیر","پمپ بنزین امام حسین"
            ,"پمپ بنزین","مجتمع رفاهی کوثر چترود","پمپ بنزین","جایگاه اختصاصی خدابخشی","پمپ بنزین شرکت تعاونی","بنزین پمپ","پمپ بنزین شهید رمضانزاده","پمپ بنزین حسن زاده"
            ,"پمپ بنزین چند منظوره سمنگان","پمپ بنزین خاتون آباد","پمپ بنزین حصاروئیه","پمپ بنزین","پمپ بنزین دو منظوره مس سرچشمه","پمپ بنزین رفسنجان سرچشمه","پمپ بنزین دو منظوره میرزایی"
            ,"پمپ بنزین برادران حسینی","جایگاه جوزم","پمپ بنزین رفاه","پمپ بنزین","پمپ بنزین بیاض","پمپ بنزین وcng کشکوئیه"};

    double[] KermanLongtitudes = {57.496729,57.511871,57.746865,58.598843,58.330484,57.969998,57.745993,57.505818,57.906658,57.868321
            ,57.783989,57.761462,57.760459,58.881437,58.729882,58.492366,58.22348,57.953819,57.321343,57.225013,57.356261,55.735389
            ,55.754134,55.812806,55.394095,55.711279,55.653102,55.782906,55.828488,56.43658,56.688919,56.852234,57.012043,56.933256
            ,57.029667,55.940532,56.390483,56.562004,56.585122,55.972641,55.52862,55.433889,55.21693,55.30022,55.782731,55.99418
            ,56.595107,55.023784,55.022371,55.253824,55.212532,55.443335,55.615051};

    double[] KermanLatitudes = {27.418169,27.449425,28.024833,27.790757,27.843444,28.048168,28.025253,28.229033,28.426901,28.567802
            ,28.637135,28.737082,28.743335,28.96538,28.960202,29.03082,29.145287,29.332004,30.020858,30.234981,29.225821,29.160287
            ,29.07373,28.948506,29.164081,29.34631,29.403344,29.576031,29.640478,29.941832,29.980258,30.417183,30.434725,30.603884
            ,30.759855,31.516141,31.153144,31.059481,30.849953,31.003608,29.737752,30.015676,30.033919,30.123428,30.008056,30.233443
            ,30.26262,30.13193,30.501819,30.855933,30.918551,30.702331,30.517978};

    String[] YazdPlaces = {"جایگاه پمپ گاز هرات","پمپ بنزین سپهر","پمپ بنزین هرابرجان","جایگاه تنگ چنار","پمپ بنزین","پمپ بنزین","پمپ بنزین خورشیدی","پمپ بنزین فیض آباد","جایگاه زعیمیان ( مسجد ابوالفضل )"
            ,"پمپ بنزین اطلس","پمپ بنزین","پمپ بنزین و گازوئیل","پمپ بنزین","پمپ بنزین و گازوئیل کاسپین","پمپ بنزین عقدا","پمپ بنزین امامزاده سید نورالدین احمد","جایگاه سوخت باغ ایرانی"
            ,"پمپ بنزین"};

    double[] YazdLongtitudes = {54.355782,54.347451,54.206638,54.336902,54.886579,54.505388,54.457766,53.984755,55.077011,54.657571,55.235804
            ,55.548536,55.236066,53.593782,53.669301,53.79818,53.879854,54.140081};

    double[] YazdLatitudes = {30.078934,30.087132,30.301994,31.399131,31.26652,31.563621,31.663833,31.711099,31.717972,32.346507,32.528651
            ,33.000985,32.528794,32.474579,32.443227,32.3887,32.348683,32.089304};

    String[] ArdabilPlaces = {"مجتمع خدماتي رفاهي بين راهي سحر","جایگاه سوخت و خدمات رفاهی","Gas Station","جایگاه دو منظوره آراز- بنزین ، گازوئیل و CNG","Gas stations"
            ,"Gas Station","Gas stations","مجتمع رفاهی دریا قره قشلاق"};

    double[] ArdabilLongtitudes = {47.740381,47.894789,47.856463,47.6349,48.199035,48.027853,48.444931,48.300488};

    double[] ArdabilLatitudes = {38.752369,38.936878,38.53588,38.383269,38.515836,38.038447,37.957854,37.760289};

    String[] BandarAbbasPlaces = {"جایگاه سوخت سوری","مجتمع خدماتی رفاهی شریفی","پمپ بنزين روستاي زيكدف","پمپ بنزین گابریک","جایگاه سوخت قطالی","جایگاه سوخت نظام پور","پمپ بنزین"
            ,"مجتمع تجاری پندار","جایگاه اختصاصی پیمان","جایگاه سوخت","پمپ بنزین","پمپ بنزین آل رسول الله","پمپ بنزین تیرور","پمپ بنزین","پمپ بنزین آبگون","پمپ بنزین حسنلنگی"
            ,"پمپ بنزین","پمپ بنزین درتوجان","پمپ گازوئیل چاه فعله","جایگاه سوخت ایسین","جایگاه الماس خلیج فارس","آفتاب درخشان","مرکز رفاهی آریا","پمپ بنزین","پمپ بنزین"
            ,"پمپ بنزین(جایگاه اختصاصی آشینه)","پمپ بنزین","پمپ بنزین صدفی","پمپ بنزین چاه مسلم","پمپ بنزین چاه بنارد","پمپ بنزین الماس خلیج فارس","پمپ بنزین کهورستان"
            ,"پمپ بنزین بابا غلام","پمپ بنزین","پمپ بنزین و مجتمع خدمات رفاهی سیب","جایگاه بنزین و گازوئیل","مجتمع خدماتی رفاهی اهورا","پمپ بنزین","پمپ بنزین","پمپ بنزین"
            ,"پمپ بنزین بلعسکر","پمپ بنزین هشنیز","پمپ بنزین"};

    double[] BandarAbbasLongtitudes = {58.969018,58.836113,58.748955,58.478754,57.825639,57.783304,57.517241,57.367724,57.151188,57.071693
            ,57.053714,57.116651,56.967876,57.412672,57.247429,56.900753,56.819963,56.787643,56.606234,56.269247,56.218849,56.216298,56.10497
            ,56.021222,55.90522,55.721915,55.093844,54.510596,54.548993,54.610422,55.541566,55.611135,56.333611,56.327251,56.274115,56.220335
            ,56.079261,55.875192,55.805676,55.792935,53.896958,53.501883,52.917081};

    double[] BandarAbbasLatitudes = {25.695987,25.65683,25.683032,25.775883,25.686236,25.780225,25.85753,25.859048,26.483584,26.695921
            ,26.798632,26.968027,27.352523,27.500914,27.473344,27.389142,27.373431,27.370295,27.343168,27.288874,27.216641,27.195399
            ,27.150733,27.103022,27.074845,27.023054,26.701277,26.608414,26.742724,27.251697,27.228179,27.205585,27.33004,27.431898
            ,27.492056,27.608685,27.751292,28.333979,28.425739,28.45748,26.895217,27.07747,27.287235};

    String[] ArakPlaces = {"پمپ بنزین آفتاب","پمپ بنزین افلاک","جایگاه دو منظوره ملکی","جایگاه سوخت قدیری","جایگاه سوخت آریان دشت","جایگاه اختصاصی آسمان","جایگاه اختصاصی فدک"
            ,"جایگاه سوخت ایرانیان","جایگاه اختصاصی قائم (عج) هجیب","جایگاه اختصاصی خورشید","پمپ بنزین ارس","پمپ بنزین آسیابک","پمپ بنزین آریا","جایگاه اختصاصی پرندک","جایگاه اختصاصی باران ۲"
            ,"Gas stations","جایگاه اختصاصی الماس","جایگاه اختصاصی الماس غرب","پمپ بنزین سلفچگان","Gas stations","Gas Station","جایگاه اختصاصی گل سنگ","جایگاه همای سعادت"
            ,"پمپ بنزین جلالیه","پمپ بنزین نراق","جایگاه اختصاصی آفتاب شرق","gas station","پمپ بنزین شهابیه","جایگاه سوخت لاله صحرا","پمپ بنزین خیرآباد","Gas Station","پمپ بنزین"
            ,"پمپ بنزین معراج","پمپ بنزین آپادانا","Gas Station","زائر سرای حضرت زینب","Gas Station","پمپ بنزین ایبک آباد","پمپ بنزین فرمهین","پمپ بنزین خنجین"};

    double[] ArakLongtitudes = {49.305531,49.324948,49.716204,49.80552,49.859709,50.272846,50.403129,50.374985,50.159815,50.340835,50.443647
            ,50.49874,50.598982,50.673488,50.731472,50.56812,50.455654,50.387828,50.464598,50.537431,50.553888,50.618546,50.648884,50.668431
            ,50.821501,50.74492,50.550623,50.206559,49.971506,49.996732,50.268725,50.337648,49.615994,49.556466,49.490081,49.425894,49.216176
            ,49.684847,49.686704,49.531805};

    double[] ArakLatitudes = {35.120141,35.125321,35.128871,35.109528,35.091397,35.101295,35.010324,35.067987,35.523954,35.262472,35.254344
            ,35.318507,35.374476,35.368057,35.352673,35.254185,35.121337, 34.852961,34.476931,34.279906,34.220835,34.092914,34.040187,34.014013
            ,34.007186,33.920153,33.877577,33.717696,34.13725,34.151411,34.322273,34.374992,34.043343,34.017925,34.020535,34.035488,34.018913
            ,34.25759,34.499987,34.747402};

    String[] ZanjanPlaces = {"gas station","پمپ بنزین و سی ان جی شهر سفید","Gas Station","پمپ بنزین زرین اباد","پمپ بنزين حاج اژدر","Eshragh Gas Station"
            ,"جایگاه CNG شهرآفتاب","Gas stations","Gas stations","Gas stations","جایگاه غزال","پمپ بنزین کریمخانی و یعقوبی","مجتمع خدماتی،رفاهی و گردشگری آتا گنجی قروه حسینی"};

    double[] ZanjanLongtitudes = {47.984062,48.17544,48.423553, 48.28808,48.069844,48.777806,48.941738,48.605537,48.47423,48.474043
            ,49.201092,49.173444,49.402758};

    double[] ZanjanLatitudes = {37.034063,36.840404,36.74032,36.434024,36.298454,36.520429,36.410477,36.028661,35.71091,35.71164,36.252188
            ,36.234959,36.060383};

    String[] SanandajPlaces = {"پترو صدف قادر جایگاه خانزاده","پمپ بنزین و مجتمع رفاهی وکیلی","پمپ بنزین دو منظوره صاحب","مجتمع خدماتی رفاهی حسین فیض اله بیگی","پمپ بنزین حیدری"
            ,"پمپ بنزین قیله سون","مجتمع گردشگری سپهرتابناک غرب","سفیلک","جایگاه سوخت اخترکاوان - پمپ بنزین و گاز","پمپ بنزین کامیار","پمپ بنزین ناصری","طاینه پمپ بنزین صادقی","پمپ بنزین بابارشانی","پمپ بنزین وپمپ گاز خورخوره"
            ,"پمپ بنزین مغانلو"};

    double[] SanandajLongtitudes = {45.90954,46.244094,46.452202,46.236425,46.206792,46.374852,47.076964,46.938547,46.268703,46.697925
            ,47.013193,46.964424,47.790083,47.803528,47.897491};

    double[] SanandajLatitudes = {36.016355,36.221629,36.199738,36.320731,36.448395,36.211085,35.870891,36.045759,35.411608,35.374538
            ,35.246667,34.99521,35.680987,35.964747,36.165556};

    String[] QazvinPlaces = {"مجتمع خدمات رفاهی آریا","Gas Station","Gas Station","جایگاه اختصاصی مهتاب الموت","جایگاه ابرهای طلایی شمال","پمپ بنزین یعقوبی","پمپ بنزین، قزوین،روستای نظام آباد"
            ,"جایگاه جنوبی آفتاب درخشان","Toranj gas station","Gas Station","Gas Station","مجتمع خدمات و رفاهی ستاره شهر","جایگاه دومنظوره مهرورزان","پمپ بنزین نژاد بهرام"
            ,"پمپ بنزین موسوی","جایگاه گاز cng یاس","جایگاه سوخت نصیری","Chehel Cheshmeh Gas Station","پمپ بنزین آبگرم","پمپ بنزین محمد امین","مجتمع خدمات رفاهی خرم تورال"
            ,"مجتمع خدماتی رفاهی تات","پمپ گاز Cng و بنزین شهرداری دانسفهان","مجتمع رفاهی","مجتمع خدمات رفاهي","مجتمع خدماتی رفاهی الماس درخشان","مجتمع خدمات رفاهی پارسین"
            ,"مجتمع خدمات رفاهی معدن نژاد","مجتمع خدماتی رفاهی مرادی آبیک","Gas Station"};

    double[] QazvinLongtitudes = {49.535101,49.513238,49.592254,49.709759,49.843288,49.860915,49.866754,49.974797,49.893937,49.909753
            ,49.958583,49.801652,49.76607,49.638775,49.591337,49.507872,49.436018,49.307221,49.29211,49.217573,49.532524,49.70457
            ,49.746453,50.061821,50.227393,50.199279,50.362538,50.443734,50.555709,50.442711};

    double[] QazvinLatitudes = {36.581966,36.497259,36.370045,36.341145,36.302766,36.308113,36.292913,36.315759,36.226215,36.224266
            ,36.249026,36.14932,36.121765,36.024592,36.049929,35.939332,36.041719,35.776974,35.763231,35.560349,35.876603,35.843483
            ,35.827028,35.87438,35.748232,36.227146,36.131557,36.093236,36.045244,36.09165};

    String[] KhorramabadPlaces = {"پل سیمره","پمپ بنزین زانوگه","Gas Station","Gas Station","پمپ بنزین چاغروند","gas station","مجتمع خدماتی رفاهی آبشار زال"
            ,"پمپ بنزین سوری","Gas Station","Gas Station","جایگاه ضرونی","gas station","پمپ بنزین","gas station","پمپ بنزین","پمپ بنزین یدی تایگر"
            ,"پمپ بنزین زمانی","جایگاه سوخت طهماسبی","پمپ بنزین چغاسعید","Shahivand gas station","پمپ گاز","Gas Station","gas station","جایگاه اختصاصی گنج افروز"
            ,"پمپ بنزین 142","پمپ بنزین مجتمع مهر","پمپ بنزین جوجو","Gas Station","مرکزخدماتی رفاهی اریا سه راهی بروجردنهاوندملایر","پمپ بنزین و گازوئیل چغابدار"
            ,"جایگاه اختصاصی پورپرور","پمپ بنزین","جايگاه خدمات رفاهي باران","پمپ بنزين و گاز سالاروند","پمپ بنزین وگاز","پمپ بنزین بهرامسری","Chaman Goli Gas Station","پمپ بنزین"};

    double[] KhorramabadLongtitudes = {47.050291,47.431596,47.589936,47.732246,47.724512,47.849353,48.171757,48.22113,48.025814,47.958791
            ,47.625808,48.03948,48.22843,48.318212,48.109408,47.998756,47.970761,47.763468,47.643137,48.473276,48.725084,48.913283
            ,48.910964,48.815804,48.797516,48.811337,48.715297,48.64054,48.652915,49.022172,49.043814,49.084719,49.144894,49.406102
            ,49.681688,49.737714,49.922221,49.940665};

    double[] KhorramabadLatitudes = {33.693897,33.453531,33.261271,33.20974,33.13315,32.942553,33.132907,33.439619,33.489807,33.376675
            ,33.528437,33.557047,33.490658,33.556307,33.894621,34.043117,34.093271,34.199387,34.264894,33.489609,33.49864,33.599004
            ,33.666101,33.801936,33.831927,33.852517,33.934949,34.008659,34.086091,33.518207,33.499244,33.496257,33.484843,33.448251
            ,33.414428,33.37624,33.265766,33.515664};

    String[] GorganPlaces = {"پمپ بنزین‌ تیره گر","پمپ بنزین وجایگاه گازخودرو","پمپ بنزین و گازوئیل پنچپیکر","جایگاه پمپ بنزین دوگونچی","جایگاه سوخت پوری","مجتمع رفاهی باران - پمپ گاز و بنزین"
            ,"پمپ بیزین و گاز CNG","پمپ بنزین،گاز و گازوئیل ثامن الحجج","پمپ گاز CNG خان ببین","پمپ بنزین خان ببین","جایگاه اختصاصی دومنظوره دلند","پمپ بنزین","پمپ بنزین بردی پور"
            ,"جایگاه سوخت،پمپ بنزین مرکزی","پمپ بنزین نسیم","پمپ بنزین اینچه برون","جایگاه سوخت توسلی","جایگاه پمپ بنزین طاطار","جایگاه دومنظوره کمالزاده","پمپ بنزین دهنه"
            ,"پمپ بنزین پیشکمر","Abshar lowh Petrol Station","پمپ بنزین","پمپ گازوییل مم","پمپ بنزین شفاهی","gas station"};

    double[] GorganLongtitudes = {54.212675,54.297127,54.136099,54.416278,54.502682,54.580388,54.662956,54.900038,54.9765,54.991519
            ,55.059182,55.153519,55.165152,55.166957,54.830354,54.712746,55.167916,55.235278,55.505934,55.495127,55.549844,55.647436
            ,55.615514,55.232982,55.267296,55.466901};

    double[] GorganLatitudes = {36.818823,36.833165,36.925574,36.993495,37.013653,36.860732,36.879786,36.928201,36.997972,37.014321,37.036984
            ,37.082782,37.141936,37.207321,37.086069,37.449854,37.295527,37.23653,37.316577,37.436054,37.520287,37.372047,37.361018,37.140282
            ,37.070363,36.90739};

    String[] SariPlaces = {"پمپ بنزین رضی کاظمی","جایگاه دو منظوره سروری","پمپ بنزین کاوه داران","پمپ بنزین کاوه نژاد","جایگاه دو منظوره فیروزی","پمپ بنزین نامور","جایگاه اختصاصی نشتارود",
            "Gas Station","جایگاه دو منظوره فجر","پمپ بنزین کلارآباد (پسندی)","پمپ بنزین شرکتی ۲ (سردآبرود)","جایگاه سوخت جعفری","جایگاه دو منظوره صادقی","جایگاه دو منظوره پاسارگاز"
            ,"پمپ بنزین مشایخی","پمپ بنزین مرزن آباد","پمپ بنزین","جایگاه اختصاصی بهروز","پمپ بنزین ملکی","جایگاه سوخت ملکی خداجو","پمپ بنزین پارس","پمپ بنزین رسام","پمپ بنزين قدس"
            ,"پمپ بنزين و گاز رويان","جایگاه اختصاصی نور","پمپ بنزین ایزدشهر","پمپ بنزین شیانی","جایگاه اختصاصی بابانیا","پمپ بنزین اختصاصی کیان پور","پمپ بنزین جمشیدی","Gas Station"
            ,"پمپ بنزین","پمپ بنزین نارنجستان","پمپ بنزین شاهزید","پمپ بنزین وانا","پمپ بنزین پلور","پمپ بنزین مرزبند","پمپ بنزین دریاکنار","پمپ بنزین باقریان-پازوار","Gas & CNG stations","جایگاه اختصاصی داودیان"
            ,"پمپ بنزين موسوی","ایستگاه پمپ بنزین ورشویی","پمپ بنزین و CNG","اسدی","پمپ بنزين","جایگاه بنزین شیرگاه","CNG - پمپ بنزین","پمپ گاز CNG پل سفید","پمپ بنزین پل سفید"
            ,"جایگاه گاز طبیعی نادری","بنزین وسی ان جی شمس","پمپ بنزین ابراهیمی کیاسری","پمپ بنزین تلمادره - باجان","جایگاه اختصاصی افزا","پمپ بنزین جایگاه مهمان نواز","Lalim Fuel Cng پمپ گاز سی ان جی"
            ,"پمپ بنزین اسلام آباد","جایگاه سوخت و مجتمع خدمات بین راهی تیموری","کوچک نژاد رستمکلا","جایگاه سوخت کوهستان","پمپ بنزین","پمپ بنزین محمدپورخلیلی","جایگاه سوخت قلعه پایان"
            ,"gas station","پمپ بنزین ستاری-حجازی","پمپ بنزین هشتیکه","پمپ بنزین"};

    double[] SariLongtitudes = {50.644798,50.681243,50.708323,50.7375,50.831488,50.856051,51.007948,51.087319,51.133383,51.281374,51.379874
            ,51.397708,51.395941,51.397186,51.307089,51.304803,51.281922,51.473998,51.499496,51.521974,51.592746,51.656869,51.82853,51.947235
            ,52.018002,52.154693,52.221671,52.274453,52.316088,52.321415,52.351674,52.346345,52.365447,52.363785,52.26268,52.035152,52.418726
            ,52.59798,52.640148,52.72498,52.789846,52.898756,52.913195,52.779358,52.922399,52.852903,52.880693,52.991393,53.053564,53.068913
            ,53.079452,53.085242,53.496358,53.735993,53.770743,53.181853,53.199537,53.22057,53.340821,53.415024,53.466031,53.60128,53.644826
            ,53.669012,53.753797,53.801667,53.829313,53.921296};

    double[] SariLatitudes = {36.940388,36.902868,36.89548,36.883219,36.839265,36.811684,36.75704,36.732676,36.72144,36.695455,36.686965
            ,36.677085,36.673892,36.664811,36.46159,36.458191,36.251515,36.64101,36.63766,36.636754,36.618904,36.596762,36.576563,36.569591
            ,36.577077,36.60204,36.614949,36.602736,36.545449,36.533765,36.375068,36.402404,36.296111,36.208022,35.940312,35.833232,36.662255
            ,36.694135,36.623094,36.695513,36.680208,36.691058,36.624293,36.49377,36.49575,36.39381,36.31617,36.17062,36.122748,36.097353
            ,36.501398,36.476429,36.253069,36.218961,36.115856,36.57434,36.581349,36.600769,36.661192,36.681123,36.690937,36.696937,36.708016
            ,36.709681,36.726683,36.733175,36.736417,36.750517};

    String[] BojnourdPlaces = {"جایگاه پمپ بنزین کمالی","CNG گلمندره","gas station","Robat-e Qarebil CNG Station","جایگاه پمپ بنزین شرفی","پمپ بنزین مهمانک"
            ,"پمپ بنزین قره چورلو","پمپ بنزین سیدالشهدا","پمپ بنزین چشمه","Qashamshami Gas Station","پمپ بنزین فلاح","پمپ بنزین و گاز یزدانی","جایگاه اختصاصی قناد زاده"
            ,"Petrol Station","پمپ بنزین و گاز کاظمی","پمپ بنزین و گازوئیل و پمپ گاز","gas station","پمپ بنزین فاروج"};

    double[] BojnourdLongtitudes = {56.042288,56.092257,56.25874,56.312326,56.512743,56.868349,56.951198,56.277462,56.312297,57.401616
            ,57.490425,57.313645,57.43721,57.482056,57.880086,57.913344,58.001099,58.222607};

    double[] BojnourdLatitudes = {37.32859,37.299901,37.33824,37.350543,37.408113,37.512338,37.571753,37.009615,36.972535,37.133195,37.062212
            ,37.436157,37.481896,37.512906,37.416341,37.389749,37.385468,37.230295};

    String[] BushehrPlaces = {"Hasanpour gas station","Imen Safar Petrol Station","پمپ بنزین سمنگان دارالمیزان","پمپ بنزین خلیج فارس","پمپ بنزین","پمپ بنزین صنعت گستران دشتی"
            ,"پمپ بنزین بوشکان","Gas Station","پمپ بنزین تالار ها","gas station","پمپ گاز آبپخش","پمپ بنزین","پمپ بنزین","پمپ بنزین","پمپ بنزین اخلاقی بندر امام حسن"};

    double[] BushehrLongtitudes = {52.384044,52.38493,52.34991,52.086925,51.607825,51.466286,51.697128,51.055113,51.219964,51.291179
            ,51.059335,50.787566,50.566609,50.485285,50.284452};

    double[] BushehrLatitudes = {27.653482,27.814622,27.993831,27.811424,28.219645,28.48466,28.834606,29.04832,29.303176,29.453822
            ,29.383809,29.541144,29.580008,29.619187,29.824003};

    String[] BirjandPlaces = {"جایگاه CNG","پمپ بنزین خاوران","پمپ بنزین دهشک","پمپ گاز CNG","پمپ هیزمی مار گیر","پمب بنزین رضایی","پمپ گاز و بنزین","پمپ بنزین","پمپ بنزين"
            ,"پمپ بنزین شهید چمران مهر شهر","جايگاه اختصاصي مهراب مود","پمپ بنزین سربیشه","مجتمع خدمات رفاهی مرجان","پمپ بنزین شوسف","متجمع رفاهی بعثت","جایگاه اختصاصی عرضه بنزین و نفت گاز وحدت"
            ,"پمپ بنزین سفید آبه","جایگاه اختصاصی ثامن","پمپ بنزین خور","جایگاه چند منظوره دیگ رستم","gas station","پمپ بنزین","علی ابن موسی الرضا"};

    double[] BirjandLongtitudes = {58.811928,58.817765,58.835006,59.217766,59.206803,59.184495,59.235759,59.299633,59.288479,59.25837
            ,59.508195,59.800437,60.857451,60.016929,60.055205,60.669627,60.539896,58.895955,58.448222,57.51152,57.513192,56.87299
            ,56.936081};

    double[] BirjandLatitudes = {34.006634,33.975465,33.920731,33.733524,33.731551,33.655424,33.333307,32.985574,32.933991,32.907785
            ,32.730614,32.583129,32.163817,31.810116,31.526866,31.453491,30.967943,32.784987,32.934436,32.276317,33.287764,33.549883
            ,34.354697};

    String[] IlamPlaces = {"پمپ بنزین یونسی دهلران","پمپ بنزین حسنی","پمپ بنزین کاور","gas station","Gas Station","پمپ بنزین صالح آباد","پمپ بنزین و گاز"
            ,"پمپ بنزین علی میرزا جمشیدی","پمپ بنزین کارزان","پمپ بنزین شباب"};

    double[] IlamLongtitudes = {47.290767,47.258733,46.817414,46.190665,46.198194,46.190661,46.392207,46.351903,46.523443,46.638719};

    double[] IlamLatitudes = {32.672709,32.69872,32.874237,33.114999,33.468253,33.53787,33.600389,33.630004,33.726141,33.751065};

    String[] ShahrekordPlaces = {"پمپ بنزین محمودی","جایگاه دو منظوره سوخت گلشور(کیانپور لیر هارانی)","پمپ بنزین","پمپ بنزین بلداجی","پمپ بنزین و گازوئیل","پمپ گاز CNG","پمپ بنزین"
            ,"پمپ بنزین","پمپ بنزین کیار","ايستگاه گاز شلمزار","جایگاه سوخت گهرو"};

    double[] ShahrekordLongtitudes = {50.806822,50.539751,50.732524,51.06727,51.185581,51.145478,51.246974,51.255496,50.814843,50.840337
            ,50.878032};

    double[] ShahrekordLatitudes = {31.523814,31.734791,31.942888,31.934309,31.808931,31.548091,31.232573,31.943621,32.060735,32.043692
            ,32.019392};

    String[] SemnanPlaces = {"gas station","پمپ بنزین،گازوئیل پارسیان","جایگاه اختصاصی ایران","پمپ بنزین و جایگاه CNG","پمپ بنزین و پمپ گاز","پمپ بنزین ال جلال","پمپ بنزین مهزیار"
            ,"جایگاه سوخت و گاز طبیعی برزی ـ سرخه","پمپ بنزین رهبر","ترانی","پمپ بنزین گل نرگس","پمپ بنزین آهوان","کاروانسرای پارس","جایگاه دو منظوره جندالله","زائر سرای قمر بنی هاشم"
            ,"جایگاه سوخت ثامن الحجج","پمپ بنزين زرين آباد","پمپ بنزین جایگاه اختصاصی استاد شهریار","جایگاه سوخت سریر امام رضا (ع)","پمپ بنزین و CNG","پمپ بنزین","پمپ بنزین"
            ,"پمپ بنزین و استراحت‌گاه ثامن الائمه","پمپ بنزین و گازوئیل سربداران","پمپ بنزین مهدی نیا","پمپ بنزین","رستوران و پمپ بنزین زائرسرای امام جواد (ع)","پمپ بنزین مارال ستاره"
            ,"پمپ بنزین عباس اباد","پمپ بنزین و مجتمع خدماتی رفاهی","پمپ بنزین","Biarjomand","پمپ بنزین شبانه روزی سید تقی"};

    double[] SemnanLongtitudes = {51.901462,52.035981,52.155039,52.342032,52.392754,52.953785,53.082103,53.199724,53.294286,53.3505,53.357319
            ,53.736325,53.990469,54.143158,54.268845,54.457941,54.559259,54.71309,54.769961,55.006912,55.078222,55.265844,55.107065,55.49906
            ,55.665332,55.871523,55.793664,56.052066,56.381825,54.307925,55.007006,55.802867,56.776265};

    double[] SemnanLatitudes = {35.382315,35.358111,35.17123,35.24166,35.237435,35.295161,35.399004,35.467811,35.514308,35.705729,35.626991
            ,35.765474,35.924824,36.060726,36.118349,36.20943,36.233794,36.272553,36.28986,36.490039,36.592643,36.711452,36.43536,36.42175
            ,36.413883,36.586625,36.413006,36.427743,36.355649,35.921017,35.444275,36.081621,35.590601};

    String[] YasujPlaces = {"پمپ بنزین","پمپ گاز و بنزین خلیج فارس معصومی - شمشیرگران","پمپ بنزين معصومی","پمپ بنزین","پمپ بنزین و گاز"};

    double[] YasujLongtitudes = {51.588489,51.533705,51.516504,51.320603,51.260374};

    double[] YasujLatitudes = {30.619414,30.695872,30.722961,30.878301,30.956351};

    String[] HamedanPlaces = {"Gas Station","پمپ بنزین ستاره غرب","جایگاه سوخت قبادی","پمپ بنزین هیوا","پمپ بنزین شهیدی","پمپ بنزین پیمان","جایگاه سوخت سفینه غرب"
            ,"پمپ بنزین شهید محمدی","Gas stations","جایگاه دو منظوره کمالزاده","مجتمع خدماتی رفاهی مهربان","پمپ بنزین قباق تپه","پمپ بنزین ولیعصر","پمپ بنزین پرواز"
            ,"جایگاه سوخت پردیس غرب","پمپ بنزین آریا","پمپ بنزين رزن","جایگاه سوخت هگمتانه","جایگاه سوخت فدک","Amir Ashraf Gas Station","جایگاه سوخت ایران زمین"
            ,"جایگاه گاز پایانه کالا","پمپ بنزین خلیج فارس","پمپ بنزین معراج","پمپ بنزین گرجی","پمپ بنزین سپنتا","Amini & Rezaei Gas Station","پمپ بنزین و گاز نظری"
            ,"پمپ بنزین یاریاری","Gas Station","Gas Station","Gas Station"};

    double[] HamedanLongtitudes = {48.848144,48.877284,48.682234,48.638054,48.598833,48.664716,48.74757,48.728163,48.692268,48.719416
            ,48.780381,48.711792,48.998475,49.065562,48.896483};

    double[] HamedanLatitudes = {35.136525,35.050815,35.045736,35.017301,34.983463,34.788712,34.553906,34.492533,34.441713,34.343873
            ,34.317743,34.219206,34.155991,34.115824,34.192681};

    double[] longtitudes = {51.42151, 59.56796, 51.67462, 50.99155, 52.53113, 46.2919, 50.8764, 48.6842, 47.065, 45.07605, 49.58319, 60.8629, 57.07879,
            54.3675, 48.2933, 56.2808, 49.68916, 48.4787, 46.99883, 50.0041, 48.35583, 54.44361, 53.06009, 57.333332, 50.8166634, 59.22114, 46.4227,
            50.8556632, 53.9191629, 51.58796, 48.5166646};
    double[] latitudes = {35.69439, 36.31559, 32.65246, 35.83226, 29.61031, 38.08, 34.6401, 31.31901, 34.31417, 37.55274, 37.28077, 29.4963, 30.28321,
            31.89722, 38.2498, 27.1865, 34.09174, 36.6736, 35.31495, 36.26877, 33.48778, 36.84165, 36.56332, 37.47166478, 28.9833294, 32.86628, 33.6374,
            32.32333204, 35.23416573, 30.66824, 34.7999968};

    double[] borderLongtitude = {51.092977, 51.316824, 51.595602, 51.471662, 59.437313, 59.608288, 59.720211, 59.621334, 51.565480, 51.573720,
            51.832585, 51.679463, 50.892403, 50.977547, 51.038659, 50.995400, 52.406663, 52.387437, 52055632, 52.632570, 46.181107, 46.165314, 46.236036, 46.496964,
            50.766911, 50.844502, 50.924153, 50.925526, 48.580632, 48.0581662, 48.779759, 48.660626, 47.084191, 47.158349, 47.192681, 47.050546,
            44.978390, 45.060788, 45.141812, 45.018216, 49.500873, 49.631679, 49.643009, 49.664620, 60.787119, 60.827288, 60.965990, 60.821794,
            56.949346, 57.044618, 57.169244, 57.056634, 54.220891, 54.404056, 54.448688, 54.379680, 48.269963, 48.413129, 48.339641, 48.233898,
            56.028460, 56.222094, 56.445254, 56.208362, 49.614663, 49.687190, 49.801431, 49.827866, 48.400180, 48.522060, 48.582141, 48.474681,
            46.963666, 47.014135, 47.059797, 47.008985, 49.950765, 50.043119, 50.081228, 50.006384, 48.251779, 48.300016, 48.443868, 48.306539,
            54.358753, 54.428104, 54.488701, 54.466042, 53.024383, 53.063865, 53.119484, 53.078285, 57.260611, 57.322066, 57.389701, 57.389701,
            57.301124, 50.808392, 50.825558, 50.910359, 50.983830, 59.164337, 59.266991, 59.304242, 59.262013, 46.384138, 46.417527, 46.448082,
            46.430229, 50.787391, 50.905151, 50.938282, 50.837688, 53.331756, 53.364715, 53.424110, 53.436469, 51.515659, 51.525616, 51.573337,
            51.592907, 48.474016, 48.540277, 48.575296, 48.502169};

    double[] borderLatitude = {35.746661, 35.806825, 35.735515, 35.561986, 36.355626, 36.363368, 36.245503, 36.191768, 32.647180, 32.818722,
            32.652383, 32.506577, 35.874979, 35.874979, 35.888331, 35.775602, 35.740498, 29.620146, 29.829445, 29.688172, 29.500095, 38.169952,
            38.041359, 38.032166, 38.010529, 34.590769, 34.812057, 34.663091, 34.598117, 31.359239, 31.359826, 31.383569, 31.252171, 31.887119,
            31.928213, 31.833173, 31.794080, 38.306579, 38.350210, 38.206925, 38.189387, 27.118381, 27.223451, 27.274729, 27.147713, 34.046966,
            34.129422, 34.075124, 34.025628, 36.695041, 36.725867, 36.639138, 36.659245, 35.349903, 35.344302, 35.304806, 35.228841, 36.280369,
            36.326575, 36.238844, 36.228875, 33.441765, 33.571516, 33.443842, 33.406878, 36.841490, 36.868961, 36.848496, 36.794354, 36.549019,
            36.593962, 36.561705, 36.517156, 37.482710, 37.536090, 37.479169, 37.425476, 28.919016, 29.001329, 28.932238, 28.915110, 32.868152,
            32.910243, 32.845656, 32.831233, 33.627415, 33.652568, 33.647780, 33.621554, 32.386400, 32.356098, 32.293578, 32.316792, 35.550300,
            35.616892, 35.590374, 35.567896, 30.721824, 30.746612, 30.702638, 30.625855, 34.830629, 34.880213, 34.793985, 34.744489};


    public GPSTracker(Context context) {
        this.context = context;
        getLocation();
    }

    public double getNearestPlaceLatitude() {
        return nearestPlaceLatitude;
    }

    public double getNearestPlaceLangtitude() {
        return nearestPlaceLangtitude;
    }

    public Location getLocation() throws SecurityException{
        minPlaceDistance = Double.MAX_VALUE;
        placeName = "";
        locationManager = (LocationManager) context.getSystemService(Context.LOCATION_SERVICE);
        isGPSEnabled = locationManager.isProviderEnabled(LocationManager.GPS_PROVIDER);
        isNetworkEnabled = locationManager.isProviderEnabled(LocationManager.NETWORK_PROVIDER);

        if (isGPSEnabled && isNetworkEnabled) {
            canGetLocation = true;
            if (isNetworkEnabled) {
                if(checkPermissions()) {
                    locationManager.requestLocationUpdates(LocationManager.NETWORK_PROVIDER, timeUpdate, distanceUpdate, this);
                    if(locationManager != null) {
                        location = locationManager.getLastKnownLocation(LocationManager.NETWORK_PROVIDER);
                        if(location != null) {
                            latitude = location.getLatitude();
                            longtitude = location.getLongitude();
                            //Log.d("location information 2", "lat : " + latitude + " long : " + getLongtitude());

                        }
                    }
                } else {
                    requestPermissions();
                }

            }

            if(checkPermissions()) {
                if(isGPSEnabled && location == null) {
                    locationManager.requestLocationUpdates(LocationManager.GPS_PROVIDER, timeUpdate, distanceUpdate, this);
                    if(locationManager != null) {
                        location = locationManager.getLastKnownLocation(LocationManager.GPS_PROVIDER);
                        if(location != null) {
                            latitude = location.getLatitude();
                            longtitude = location.getLongitude();

                            //Log.d("location information 3", "lat : " + latitude + " long : " + getLongtitude());

                        }
                    }
                }
            } else {
                requestPermissions();
            }

        } else {
            canGetLocation = false;
            Log.d("error", "error");
        }

        measuringDistance();
        return location;
    }

    private void measuringDistance() {
        for (counter = 0; counter < 31; counter++) {

            destLocation.setLatitude(latitudes[counter]);
            destLocation.setLongitude(longtitudes[counter]);
            if(location != null) {
                location.setLongitude(location.getLongitude());
                location.setLatitude(location.getLatitude());
                result[counter] = location.distanceTo(destLocation);
            }
        }
        Log.d("entering measuring", "sdvhkdfhvl");
        min = result[0];
        cityIndex = 0;
        for (counter = 0; counter < 31; counter++) {
            if (result[counter] < min) {
                min = result[counter];
                cityIndex = counter;
            }
        }

        if(result[cityIndex] > 30000) {
            for(counter = (cityIndex * 4); counter < (cityIndex * 4) + 4; counter++) {
                if(location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(borderLatitude[counter]);
                    destLocation.setLongitude(borderLongtitude[counter]);
                    if (location.distanceTo(destLocation) < result[cityIndex]) {
                        result[cityIndex] = location.distanceTo(destLocation);
                    }
                }
            }
        }
        Log.d("cityTextView", "nearest city is " + cities[cityIndex]);
        nearestCIty = cities[cityIndex];
        Log.d("distanceTextView", "your distance from this city is " + result[cityIndex] + "");
        nearestDistance = result[cityIndex];
        if (result[cityIndex] < 30000) {
            Log.d("areaTextView", "you are in area of " + cities[cityIndex]);
        }
        

        if(nearestCIty == "Tehran") {
            for(counter = 0; counter < TehranPlaces.length; counter++) {
                if(location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(TehranLatitudes[counter]);
                    destLocation.setLongitude(TehranLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = TehranPlaces[counter];

                        nearestPlaceLatitude = TehranLatitudes[counter];
                        nearestPlaceLangtitude = TehranLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Mashhad") {
            for(counter = 0; counter < MashhadPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(MashhadLatitudes[counter]);
                    destLocation.setLongitude(MashhadLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = MashhadPlaces[counter];

                        nearestPlaceLatitude = MashhadLatitudes[counter];
                        nearestPlaceLangtitude = MashhadLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Isfahan") {
            for(counter = 0; counter < IsfahanPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(IsfahanLatitudes[counter]);
                    destLocation.setLongitude(IsfahanLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = IsfahanPlaces[counter];

                        nearestPlaceLatitude = IsfahanLatitudes[counter];
                        nearestPlaceLangtitude = IsfahanLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Karaj") {
            for(counter = 0; counter < KarajPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(KarajLatitudes[counter]);
                    destLocation.setLongitude(KarajLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = KarajPlaces[counter];

                        nearestPlaceLatitude = KarajLatitudes[counter];
                        nearestPlaceLangtitude = KarajLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Shiraz") {
            for(counter = 0; counter < ShirazPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(ShirazLatitudes[counter]);
                    destLocation.setLongitude(ShirazLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = ShirazPlaces[counter];

                        nearestPlaceLatitude = ShirazLatitudes[counter];
                        nearestPlaceLangtitude = ShirazLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Tabriz") {
            for(counter = 0; counter < TabrizPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(TabrizLatitudes[counter]);
                    destLocation.setLongitude(TabrizLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = TabrizPlaces[counter];

                        nearestPlaceLatitude = TabrizLatitudes[counter];
                        nearestPlaceLangtitude = TabrizLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Qom") {
            for(counter = 0; counter < QomPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(QomLatitudes[counter]);
                    destLocation.setLongitude(QomLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = QomPlaces[counter];

                        nearestPlaceLatitude = QomLatitudes[counter];
                        nearestPlaceLangtitude = QomLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Ahvaz") {
            for(counter = 0; counter < AhvazPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(AhvazLatitudes[counter]);
                    destLocation.setLongitude(AhvazLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = AhvazPlaces[counter];

                        nearestPlaceLatitude = AhvazLatitudes[counter];
                        nearestPlaceLangtitude = AhvazLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Kermanshah") {
            for(counter = 0; counter < KermanshahPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(KermanshahLatitudes[counter]);
                    destLocation.setLongitude(KermanshahLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = KermanshahPlaces[counter];

                        nearestPlaceLatitude = KermanshahLatitudes[counter];
                        nearestPlaceLangtitude = KermanshahLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Orumiyeh") {
            for(counter = 0; counter < OrumiyehPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(OrumiyehLatitudes[counter]);
                    destLocation.setLongitude(OrumiyehLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = OrumiyehPlaces[counter];

                        nearestPlaceLatitude = OrumiyehLatitudes[counter];
                        nearestPlaceLangtitude = OrumiyehLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Rasht") {
            for(counter = 0; counter < RashtPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(RashtLatitudes[counter]);
                    destLocation.setLongitude(RashtLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = RashtPlaces[counter];

                        nearestPlaceLatitude = RashtLatitudes[counter];
                        nearestPlaceLangtitude = RashtLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Zahedan") {
            for(counter = 0; counter < ZahedanPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(ZahedanLatitudes[counter]);
                    destLocation.setLongitude(ZahedanLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = ZahedanPlaces[counter];

                        nearestPlaceLatitude = ZahedanLatitudes[counter];
                        nearestPlaceLangtitude = ZahedanLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Kerman") {
            for(counter = 0; counter < KermanPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(KermanLatitudes[counter]);
                    destLocation.setLongitude(KermanLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = KermanPlaces[counter];

                        nearestPlaceLatitude = KermanLatitudes[counter];
                        nearestPlaceLangtitude = KermanLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Yazd") {
            for(counter = 0; counter < YazdPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(YazdLatitudes[counter]);
                    destLocation.setLongitude(YazdLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = YazdPlaces[counter];

                        nearestPlaceLatitude = YazdLatitudes[counter];
                        nearestPlaceLangtitude = YazdLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Ardabil") {
            for(counter = 0; counter < ArdabilPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(ArdabilLatitudes[counter]);
                    destLocation.setLongitude(ArdabilLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = ArdabilPlaces[counter];

                        nearestPlaceLatitude = ArdabilLatitudes[counter];
                        nearestPlaceLangtitude = ArdabilLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "BandarAbbas") {
            for(counter = 0; counter < BandarAbbasPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(BandarAbbasLatitudes[counter]);
                    destLocation.setLongitude(BandarAbbasLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = BandarAbbasPlaces[counter];

                        nearestPlaceLatitude = BandarAbbasLatitudes[counter];
                        nearestPlaceLangtitude = BandarAbbasLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Arak") {
            for(counter = 0; counter < ArakPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(ArakLatitudes[counter]);
                    destLocation.setLongitude(ArakLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = ArakPlaces[counter];

                        nearestPlaceLatitude = ArakLatitudes[counter];
                        nearestPlaceLangtitude = ArakLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Zanjan") {
            for(counter = 0; counter < ZanjanPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(ZanjanLatitudes[counter]);
                    destLocation.setLongitude(ZanjanLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = ZanjanPlaces[counter];

                        nearestPlaceLatitude = ZanjanLatitudes[counter];
                        nearestPlaceLangtitude = ZanjanLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Sanandaj") {
            for(counter = 0; counter < SanandajPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(SanandajLatitudes[counter]);
                    destLocation.setLongitude(SanandajLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = SanandajPlaces[counter];

                        nearestPlaceLatitude = SanandajLatitudes[counter];
                        nearestPlaceLangtitude = SanandajLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Qazvin") {
            for(counter = 0; counter < QazvinPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(QazvinLatitudes[counter]);
                    destLocation.setLongitude(QazvinLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = QazvinPlaces[counter];

                        nearestPlaceLatitude = QazvinLatitudes[counter];
                        nearestPlaceLangtitude = QazvinLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Khorramabad") {
            for(counter = 0; counter < KhorramabadPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(KhorramabadLatitudes[counter]);
                    destLocation.setLongitude(KhorramabadLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = KhorramabadPlaces[counter];

                        nearestPlaceLatitude = KhorramabadLatitudes[counter];
                        nearestPlaceLangtitude = KhorramabadLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Gorgan") {
            for(counter = 0; counter < GorganPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(GorganLatitudes[counter]);
                    destLocation.setLongitude(GorganLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = GorganPlaces[counter];

                        nearestPlaceLatitude = GorganLatitudes[counter];
                        nearestPlaceLangtitude = GorganLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Sari") {
            for(counter = 0; counter < SariPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(SariLatitudes[counter]);
                    destLocation.setLongitude(SariLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = SariPlaces[counter];

                        nearestPlaceLatitude = SariLatitudes[counter];
                        nearestPlaceLangtitude = SariLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Bojnourd") {
            for(counter = 0; counter < BojnourdPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(BojnourdLatitudes[counter]);
                    destLocation.setLongitude(BojnourdLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = BojnourdPlaces[counter];

                        nearestPlaceLatitude = BojnourdLatitudes[counter];
                        nearestPlaceLangtitude = BojnourdLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Bushehr") {
            for(counter = 0; counter < BushehrPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(BushehrLatitudes[counter]);
                    destLocation.setLongitude(BushehrLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = BushehrPlaces[counter];

                        nearestPlaceLatitude = BushehrLatitudes[counter];
                        nearestPlaceLangtitude = BushehrLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Birjand") {
            for(counter = 0; counter < BirjandPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(BirjandLatitudes[counter]);
                    destLocation.setLongitude(BirjandLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = BirjandPlaces[counter];

                        nearestPlaceLatitude = BirjandLatitudes[counter];
                        nearestPlaceLangtitude = BirjandLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Ilam") {
            for(counter = 0; counter < IlamPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(IlamLatitudes[counter]);
                    destLocation.setLongitude(IlamLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = IlamPlaces[counter];

                        nearestPlaceLatitude = IlamLatitudes[counter];
                        nearestPlaceLangtitude = IlamLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Shahrekord") {
            for(counter = 0; counter < ShahrekordPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(ShahrekordLatitudes[counter]);
                    destLocation.setLongitude(ShahrekordLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = ShahrekordPlaces[counter];

                        nearestPlaceLatitude = ShahrekordLatitudes[counter];
                        nearestPlaceLangtitude = ShahrekordLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Semnan") {
            for(counter = 0; counter < SemnanPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(SemnanLatitudes[counter]);
                    destLocation.setLongitude(SemnanLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = SemnanPlaces[counter];

                        nearestPlaceLatitude = SemnanLatitudes[counter];
                        nearestPlaceLangtitude = SemnanLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Yasuj") {
            for(counter = 0; counter < YasujPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(YasujLatitudes[counter]);
                    destLocation.setLongitude(YasujLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = YasujPlaces[counter];

                        nearestPlaceLatitude = YasujLatitudes[counter];
                        nearestPlaceLangtitude = YasujLongtitudes[counter];
                    }
                }
            }
        }
        else if(nearestCIty == "Hamedan") {
            for(counter = 0; counter < HamedanPlaces.length; counter++) {
                if (location != null) {
                    location.setLongitude(location.getLongitude());
                    location.setLatitude(location.getLatitude());
                    destLocation.setLatitude(HamedanLatitudes[counter]);
                    destLocation.setLongitude(HamedanLongtitudes[counter]);
                    placeDistance = location.distanceTo(destLocation);
                    if (minPlaceDistance > placeDistance) {
                        minPlaceDistance = placeDistance;
                        placeName = HamedanPlaces[counter];

                        nearestPlaceLatitude = HamedanLatitudes[counter];
                        nearestPlaceLangtitude = HamedanLongtitudes[counter];
                    }
                }
            }
        }
    }

    public double getLatitude() {
        if(location != null) {
            latitude = location.getLatitude();
        }
        return latitude;
    }

    public double getLongtitude() {
        if(location != null) {
            longtitude = location.getLongitude();
        }
        return longtitude;
    }

    public boolean canGetLocation() {
        return this.canGetLocation;
    }

    public String getNearestCIty() {
        return nearestCIty;
    }

    public double getNearestDistance() {
        return nearestDistance;
    }

    public void ShowGPSAlertDialog() {
        AlertDialog.Builder builder = new AlertDialog.Builder(context);
        builder.setTitle("GPS").setMessage("GPS is not enabaled. Do you want to make it active?")
                .setPositiveButton("OK", new DialogInterface.OnClickListener() {
                    @Override
                    public void onClick(DialogInterface dialogInterface, int i) {
                        Intent intent = new Intent();
                        intent.setAction(Settings.ACTION_LOCATION_SOURCE_SETTINGS);
                        context.startActivity(intent);
                    }
                })
                .setNegativeButton("No", new DialogInterface.OnClickListener() {
                    @Override
                    public void onClick(DialogInterface dialogInterface, int i) {
                        dialogInterface.cancel();
                    }
                });
        builder.show();
    }

    private boolean checkPermissions() {
        if (ActivityCompat.checkSelfPermission(context, Manifest.permission.ACCESS_COARSE_LOCATION) == PackageManager.PERMISSION_GRANTED &&
                ActivityCompat.checkSelfPermission(context, Manifest.permission.ACCESS_FINE_LOCATION) == PackageManager.PERMISSION_GRANTED) {
            return true;
        }
        return false;
    }

    private void requestPermissions() {
        ActivityCompat.requestPermissions(
                (Activity) context,
                new String[]{Manifest.permission.ACCESS_COARSE_LOCATION, Manifest.permission.ACCESS_FINE_LOCATION},
                PERMISSION_ID
        );
    }

    @Override
    public void onLocationChanged(Location location) {

    }

    @Override
    public void onStatusChanged(String s, int i, Bundle bundle) {

    }

    @Override
    public void onProviderEnabled(String s) {

    }

    @Override
    public void onProviderDisabled(String s) {

    }

    @Nullable
    @Override
    public IBinder onBind(Intent intent) {
        return null;
    }

}

